{"chunk_id": "crm::press::2025-05-08::salesforce-unveils-life-sciences-partner-network-to-accelera::ef6df9c2::chunk0000", "doc_id": "crm::press::2025-05-08::salesforce-unveils-life-sciences-partner-network-to-accelera::ef6df9c2", "seq_no": 0, "text": "Salesforce announces Strategic Life Sciences Alliance - Salesforce\nSkip to Content\nSkip to Footer\n0%\nArtificial Intelligence\nSalesforce Unveils Life Sciences Partner Network to Accelerate Digital Labor and Data Programs\nMay 8, 2025\n7 min read\nMedia Library\nEditor’s Note:\nThis article was updated on May 15, 2025 to include McKesson Compile\nIndustry-leading Systems Integrators (SI) and Independent Software Vendor (ISV) partners will expedite success for organizations upgrading to the agent-first\nLife Sciences Cloud\nData integrations with athenahealth, Definitive, H1, Infinitus.ai, Viz.ai, and more will provide customers with access to real-time claims, clinical and behavioral data, and out-of-the-box skills for Agentforce to boost healthcare experiences\nNew\nAgentExchange\nactions and topics will advance agentic AI across medical research, manufacturing, and sales\nSAN FRANCISCO, May 8, 2025 –\nSalesforce (NYSE: CRM), the #1 AI CRM, today announced a network of certified life sciences partners to accelerate customer migration to Life Sciences Cloud, its\nHIPAA-ready\n,\npre-validated\n, GxP-compliant platform. Now, pharma and medical technology organizations can easily upgrade to Life Sciences Cloud and kickstart their deployment of\nAgentforce\n, Salesforce’s digital labor platform, to more easily connect data and yield insights across clinical, medical, and commercial business units.\nThis open ecosystem of agencies and consulting partners enables Salesforce customers to choose from a variety of industry services, including:\nMigration support\nto scale their transition from legacy CRM systems with agility\nAgent-first implementations\nand training\nto seamlessly deploy and extend the Agentforce digital labor platform\nData kits and topics\nto activate\nAI agents\nwith the industry context they need to reason and take action\nWhy It Matters:\nLife sciences organizations struggle with disparate systems and significant interoperability challenges. In fact, pharmaceutical and medical technology manufacturers use an average of\n78\ndifferent systems, with the health industry generating an estimated\n36%\nof all the world’s data, 90% of which is unstructured.\nAmid regulatory constraints, resource shortages, and cybersecurity risks\n, digital labor in the form of AI agents offers a\nsolution\nto expand capacity, but requires reliable data from multiple sources as well as skilled implementation.\nWhat’s New:\nThe life sciences partner network will work in tandem with Salesforce’s\nProfessional Services\nand\nCustomer Success\nteams to enable pharma and medtech organizations to harmonize all their data. Regardless of where it resides, Life Sciences Cloud can activate this data to power intelligent, personalized experiences for healthcare professionals and patients while working hand-in-hand with an extended digital workforce to realize value faster. Services include:\nMigration Alliance\nA coalition of worldwide agencies and consulting partners, along with migration framework technologies and solutions from Salesforce and its partners, will guide customers through a seamless transition from legacy platforms to Life Sciences Cloud while maintaining backward compatibility. This group includes\nAccenture\n,\nAvenga\n,\nBASE life science\n,\nCapgemini\n,\nCoastal\n,\nCognizant\n,\nDeloitte\n,\nEpista Life Science\n,\nInfosys\n,\nMavens, a Komodo Health Company\n,\nKPMG\n,\nMerkle\n,\nPublicis Sapient & Publicis Health\n,\nPwC\n,\nSlalom\n,\nTorrent\n,\nWilco Source, a CitiusTech Company\n, and\nZS\n.\nThese partners will use their extensive therapeutic development, care delivery, and technological domain to tailor the purpose-built solution to each organization’s unique needs. This commitment includes significant investments in Salesforce training and certifications, jointly developed tools for reusable data mapping and migration, and industry implementation experience and change management.\nAgent-First Implementations\nWith deep intellectual capital and global expertise, this consulting network — which includes\nMigration Alliance\npartners as well as\nBain\n,\nBoston Consulting Group (BCG)\n, and\nMcKinsey & Company\n— will help ensure solutions are finely tuned to address industry-specific challenges. Salesforce is also partnering with\nLPW Training Services\n, a leading provider of learning solutions for healthcare and life sciences, to streamline onboarding and accelerate user adoption of Life Sciences Cloud to maximize ROI. With tailored Agentforce implementation services focused on aligning intelligent technology with strategic objectives, these partners will help drive scalability and performance gains for pharmaceutical and medical technology companies by:\nStreamlining testing and reducing deployment time to lower costs and quickly resolve configuration issues\nPromoting adoption with end user training to maximize investment and enrich the user experience\nDeploying AI agents that enhance efficiency, automate workflows, and deliver actionable insights\nPrebuilt Agent Skills, Data Connectors, and Applications\nUsing\nMuleSoft\nand\nData Cloud\n, partners will\nunlock\naccess to industry data through seamless integration with Life Sciences Cloud to provide a 360-degree view of patients, HCPs, and partners. Leveraging the\nEinstein Trust Layer\nwith bidirectional,\nzero copy exchange\nand ready-to-use applications, these act as an extension of the platform and help establish a foundation for secure and trusted AI.\nathenahealth\nAPIs will enable customers to seamlessly exchange data between Salesforce and its EHR to enable real-time prior authorizations, care management, appointment scheduling, medical history, and medication refills.\nBox’s\nIntelligent Content Management integration with Life Sciences Cloud enables Commercial and R&D teams to securely collaborate, review, and e-sign critical promotional, clinical, and contract documents within Box’s GxP-compliant content layer — without leaving Salesforce.\nComplianceQuest\nsupports compliance for clinical trials, adverse event reporting, and manufacturing and will allow Agentforce to automate adverse event triage to promote timely reporting and resolution, and identify recurring risks across trial sites to prioritize mitigation efforts. Agentforce can also flag nonconformances in the manufacturing of clinical trial supplies, helping to safeguard product quality.\nDefinitive Healthcare\nallows sales teams to get real-time access to fast insights to prepare for strategic conversations, build precise market segmentations, and craft targeted communications, right within their Salesforce environment. Users can leverage comprehensive facility-level data‌ —  including financials, clinical metrics, referral patterns, affiliations, and population health trends.\nHoneywell’s\nTrackWise Quality helps shift from reactive to proactive quality management. With enhanced tracking, analytics, and AI capabilities across quality processes, the solution suite enables life science companies to better leverage data to enhance performance and make decision-making more effective and efficient. The new Agentforce actions will focus on improving and streamlining quality issue resolution with advanced AI solutions related to chat assistance, workflow automation, and complaint intake.\nH1\nwill fuel Life Sciences Cloud with comprehensive HCP profiles aggregating publications, clinical trials, congress activity, payments, social media, organizational hierarchies, patient demographics, and medical and prescription claims to enhance HCP and Key Opinion Leaders (KOLs) identification and engagement across all touchpoints.\nInfinitu\ns.ai\n’\ns\nintegration with Life Sciences Cloud allows Agentforce to verify pharmacy or durable medical equipment (DME) eligibility by checking directly with electronic providers to validate insurance coverage, calculate copays, and collect any missing information, helping to prevent delays to treatment.\nMcKesson Compile’s\npre-built integration will bring comprehensive, up-to-date provider reference and affiliations data into Life Sciences Cloud, allowing organizations to target the right thought leaders and prescribers to build their brand. The McKesson Compile Provider 360 ReadyData™ healthcare provider dataset includes demographic, network, and behavioral data on U.S. providers, organizations, and their corresponding affiliations so you can get a deep view of HCPs and see the relationships between HCPs, healthcare organizations, and health systems.\nS2N Health’s\nRepSignal embeds expert-curated customer intelligence in the flow of work for sales, marketing, and commercial leadership. Comprehensive RepSignal data, including procedure and diagnosis volumes, referrals, Sunshine Act information, research activities, and facility metrics, deeply integrated with Life Sciences Cloud and Agentforce skills such as Pre-Visit Summary, seamlessly equips medtech teams with key insights to precisely target, engage, and convert high-value customers.\nViz.ai’s\nAI-powered care coordination solution leverages AI agents for real-time patient activation and HCP engagement to accelerate time to treatment, optimize sales and marketing effectiveness, and drive high-impact launches resulting in better patient outcomes.\nVodori’s\nAppExchange solution will accelerate the compliant review and approval of medical, legal, and regulatory (MLR) content, with automated publishing of approved assets directly into Life Sciences Cloud. This ensures MSLs and field teams can access the latest educational and promotional materials ‌— ‌seamlessly, compliantly, and in real time.\nWe are in an unprecedented market moment where, with digital labor grounded in rich data, international life sciences organizations have the opportunity to completely reimagine the way they interact with patients and HCPs.\nFrank Defesche, Senior Vice President and General Manager, Salesforce Life Sciences\nThe Salesforce Perspective:\n“We are in an unprecedented market moment where, with digital labor grounded in rich data, international life sciences organizations have the opportunity to completely reimagine the way they interact with patients and HCPs. Backed by over two decades of industry expertise, Salesforce is uniquely equipped to pioneer this next era with our deeply unified\nPlatform\nthat brings together apps, data, life sciences-specific workflows, and AI – all wrapped in trust and compliance. Together with our open ecosystem of partners, we’ll help scale the delivery of connected, agent-first experiences and outcomes, from clinical through commercial.” –\nFrank Defesche\n, Senior Vice President and General Manager, Salesforce Life Sciences\nAvailability:\nCustomers have access to Salesforce’s Professional Services, Customer Success, Migration Alliance, and Implementation Partners today.\nLPW Training Services\nis available starting today.\nISV apps, connectors, and Agentforce actions, including\nBox\n,\nCompliance Quest\n,\nRepSignal\n, and\nTrackWise Digital\nare available today on the\nAppExchange\nand\nAgentExchange\n.\nVodori integration will be available later this month on the\nAppExchange\n.\nNew Definitive, H1, and Viz.ai integrations will be available in late 2025.\nInfinitus.ai integration\nis available today via MuleSoft. Additional clearinghouse and EHR integrations will be available starting in June 2025.\nLearn More:\nRegister for\nAgentforce World Tour NYC\nor tune in on\nSalesforce+\nLearn more about Salesforce’s GxP validation with\nSware\nWatch a demonstration of Agentforce for\nLife Sciences\nRead about\nGenAI\n,\nagentic AI\n,\ncontent\n, and\ncustomer engagement\nin life sciences\nAny unreleased services or features referenced here are not currently available and may not be delivered on time or at all. Customers should make their purchase decisions based upon features that are currently available.\nShare article\nJust For You\nThe Zero Copy Imperative: IBM, Salesforce, and Snowflake Experts on Data’s Role Enabling Agentic AI\n3 min read\nWhy Daily AI Use Is Fueling More Creative and Fulfilled Workers\n4 min read\nBecome a leading customer company in your industry.\nLearn More\nShare article\nJust For You\nThe Zero Copy Imperative: IBM, Salesforce, and Snowflake Experts on Data’s Role Enabling Agentic AI\n3 min read\nWhy Daily AI Use Is Fueling More Creative and Fulfilled Workers\n4 min read\nBecome a leading customer company in your industry.\nLearn More\nExplore related content by topic\nArtificial Intelligence\nData\nDigital Transformation\nEnterprise AI\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nHow Salesforce’s Open Ecosystem Is Driving Trusted Agent Interoperability\n7 min read\nNew MuleSoft Innovations from Salesforce Enable Secure, Scalable AI Agent Orchestration for Agentic Transformation\n7 min read\nSalesforce Collaborates with UChicago Medicine to Enhance Patient Support\n3 min read\nSalesforce Launches Agentforce for Net Zero Cloud with Unified Data to Help Teams Meet Sustainability Compliance, Cut Costs, and Drive Efficiency\n14 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1959, "token_count": 2823, "start_char": 0, "end_char": 14036, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "2025-05-08", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/news/press-releases/2025/05/08/partner-network-for-life-sciences-announcement/?bc=DB", "title": "Salesforce Unveils Life Sciences Partner Network to Accelerate Digital Labor and Data Programs", "company": "Salesforce", "persona_tags": ["cio", "vp_sales_ops"]}}
