{"chunk_id": "crm::press::2024-02-28::salesforce-data-cloud::4ca56502::chunk0000", "doc_id": "crm::press::2024-02-28::salesforce-data-cloud::4ca56502", "seq_no": 0, "text": "Salesforce Data Cloud | Salesforce US\nSkip to content\nDiscover how Indeed speeds hiring with Data Cloud and Agentforce.\nData Cloud unlocks the full value of your data across the enterprise.\nNatively built on the Salesforce Platform, Data Cloud powers your Customer 360 apps, Agentforce, and amplifies your existing data lake or warehouse investments to activate real-time insights and intelligent action.\nWatch the demo\nGet started\nHow Data Cloud Works\nData Cloud is designed to work with the systems and enterprise apps you already have. It breaks down data silos and harmonizes information from your Customer 360, data lakes, warehouses, and business applications – regardless of format – using low-code tools. Through this approach, enterprises across every industry can use all their data to power Agentforce, automate workflows, and make smarter decisions.\nExplore Use Cases\nLearn How it Works\nSee how the world's most data-driven companies activate their data.\nSee all stories\nMake your data work harder. No matter where it lives.\nEnterprise data holds massive potential but can often be hard to activate. Data Cloud overcomes this with Zero Copy integrations to platforms like Snowflake and Databricks, eliminating duplication and delays to power real-time customer profiles, automated actions, personalized experiences, and smarter decisions at scale. This seamless integration extends the value of existing data lake and warehouse investments thanks to Data Cloud's market-leading customer data platform (CDP) capabilities.\nUse Zero Copy to activate Snowflake data in Data Cloud.\nLearn more\nActivate your Databricks data via Zero Copy Delta Sharing.\nLearn more\nConnect Data Cloud to your Google BigQuery warehouse via Zero Copy.\nLearn more\nActivate diverse data from AWS (S3, Redshift) via Zero Copy in Data Cloud.\nLearn more\nFlexible connectivity with 200+ connectors & the Zero Copy Partner Network.\nWith over 200 pre-built connectors, Salesforce Data Cloud seamlessly integrates data from across your business – including sources like SAP, Shopify, Zendesk, Workday and more. Through our leading\nZero Copy Partner Network\n, certain integrations allow you to access data directly in its source system without the need for traditional ETL processes or physical data movement. This provides near real-time access and reduces data duplication.\nExplore connectors\nExplore Data Cloud’s Capabilities and Features\nData Cloud Features\nConnect\nHarmonize\nGovern\nActivate\nData Sharing\nConnect\nZero Copy Integration\nConnect directly to live data in Snowflake, Databricks, Google Cloud, and more without complex ETL or data duplication, powering insights with up-to-the-moment data.\n[Learn more]\nStructured & Unstructured Data\nIngest, process, and harmonize diverse data types – from tables and logs to text, images, and streaming events – for a complete view.\n[Learn more]\n200+ Connectors\nEasily bring data in from Salesforce clouds, MuleSoft, databases, and popular third-party apps with a rich library of pre-built connectors.\n[Learn more]\nHarmonize\nIdentity Resolution\nBuild unified profiles by intelligently matching and reconciling customer identities across your different data sources and systems.\n[Learn more]\nData Prep & Transformations\nCleanse, reshape, enrich, and prepare your data for analysis and activation using intuitive, powerful transformation tools.\n[Learn more]\nUnified Data Model\nMap disparate source data to a standardized, extensible model based on Salesforce standards for consistent interpretation and use.\n[Learn more]\nGovern\nPolicy-Based Governance\nDefine and automatically enforce data usage policies, consent preferences, and compliance rules across all your connected data.\n[Learn more]\nAI Tagging & Classification\nLeverage AI to automatically identify and classify sensitive data, helping you apply appropriate governance and privacy controls.\n[Learn more]\nPrivate Connect for Data Cloud\nEstablish secure, private connections between your AWS or Azure environments and Data Cloud, avoiding public internet exposure.\n[Learn more]\nActivate\nData Cloud Triggered Flows\nInitiate real-time Salesforce automation (Flows) based on data changes, calculated insights, or streaming events processed by Data Cloud.\n[Learn more]\nSegments\nCreate dynamic audience segments using any harmonized attribute or insight for precise targeting across channels.\n[Learn more]\nInsights & Predictive Models\nGenerate calculated metrics (like LTV or engagement scores) and utilize predictive AI models to anticipate customer behavior and needs.\n[Learn more]\nData Sharing\nData Lakes & Warehouses\nSecurely share harmonized profiles, segments, or insights from Data Cloud back to external platforms like Snowflake, Databricks, BigQuery, etc.\n[Learn more]\nBusiness Applications\nPush unified data or activate segments directly into downstream business applications like marketing automation, ERP, or analytics tools.\n[Learn more]\nAdvertising Platforms\nSend customer segments directly to major advertising platforms (Google, Meta, etc.) for targeted campaigns and efficient ad spend.\n[Learn more]\nGartner® names Salesforce a Leader in Customer Data Platforms for the second year in a row.\nLearn why Gartner named Salesforce a Leader.\nRead the report\nJoin the Datablazer Community\nTap into a network of Data Cloud experts and enthusiasts. The Datablazer Community is where passionate professionals learn, connect, and innovate using data and AI across their enterprise. Join us to grow your skills.\nJoin now\nUnlock Data Cloud Potential: Guides, Webinars, and More\nBlog\nData Cloud Governance: Protecting Your Data in the Agentic Landscape\nRead the article\nBlog\nCIOs Reveal Top 3 Strategies for Unlocking AI’s Potential with Unstructured Data\nRead the article\nWebinar\nUnleashing Agentforce with Unified and Trusted Data\nWatch the webinar\nGuide\nData Activation Guide for Service\nGet the guide\nExplore all resources\nReady to take the next step with Data Cloud?\nTalk to an expert.\nTell us a bit more so the right person can reach out faster.\nRequest a call\nGet started.\nActivate Data Cloud for your team today.\nLearn more\nFrequently Asked Questions\nWhat are the benefits of Data Cloud?\nData Cloud allows you to unify all your data on Salesforce without building complex data pipelines, easily take action on all your data across every Salesforce Cloud, and enable trusted AI solutions powered by your data.\nWhat data sources can I integrate with Data Cloud?\nData Cloud allows you to ingest virtually any data source to activate data-driven decision making and a robust\ndata strategy\n. Seamlessly connect your CRM apps, like Sales and Service Cloud, using Salesforce connectors. Leverage out-of-the-box connectors with common third-party sources, including Amazon S3 and Google Cloud Storage. Take advantage of our zero copy integrations to pull in data from your existing Data Lakes and Warehouses, like Snowflake and Data Bricks, without duplicating data. And for everything else you can connect using SDKs and APIs.\nHow is Data Cloud different from other data platforms, lakes, and warehouses?\nUnlike other data platforms that focus primarily on managing and organizing data, Data Cloud was purpose-built to help companies take action on their data across everyday applications like Sales, Service, and Marketing Cloud. That's because Data Cloud is natively integrated into the Salesforce metadata framework and enables all teams, not just IT, to move faster with data using low-code tools like Flow and Agentforce.\nIs Data Cloud a data modeling tool?\nWhile Data Cloud does offer data modeling capabilities, its primary focus is to serve as a tool for activating your data. The Salesforce data model is designed to help you easily integrate your data within the Salesforce metadata framework, turning data from any source into native objects and fields ready to use across all your Salesforce applications.\nHow can Data Cloud help me automate data-driven decision making?\nWith all your data integrated into Data Cloud, you can start to automate tasks and make smarter decisions using all your company data. Sales teams can boost productivity and increase deal conversion rates by surfacing or building workflows with external data like purchase history or web engagement data. Service teams can improve customer satisfaction and reduce churn by giving agents access to external data like product engagement and device telemetry data.\nWhat types of insights can Data Cloud help unlock for my organization?\nBusinesses leveraging Data Cloud can efficiently uncover insights by using their own models or our low-code insights builder, enabling teams to quickly derive key metrics such as Propensity to Buy, Customer Lifetime Value, and Engagement Scores for each customer.\nHow does Data Cloud pricing work?\nData Cloud pricing is consumption-based, meaning you pay only for the services you use.\nCan I try Data Cloud before buying?\nExisting Salesforce customers can get started with Data Cloud for free by\nvisiting this page\n.\nHow can I get started with Data Cloud?\nExisting Salesforce customers can access this\ng\nuide to Getting Started with Data Cloud\nHow Behind The Wow: Create an Actionable 360 Profile\nHow Behind The Wow is a 5 part video series that weaves together a complete story of how Data Cloud powers Agentforce and the Salesforce C360 through one unified Salesforce Platform. Video 1 demonstrates how to create unified Customer 360 profiles to power Agentforce with Data Cloud.", "word_count": 1430, "token_count": 1834, "start_char": 0, "end_char": 9479, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/data/?bc=DB", "title": "Salesforce Data Cloud", "company": "Salesforce", "persona_tags": ["cio", "vp_sales_ops"]}}
