{"chunk_id": "crm::press::2025-05-29::salesforce-partners-with-ferrari-to-elevate-the-client-8217-::4e179049::chunk0000", "doc_id": "crm::press::2025-05-29::salesforce-partners-with-ferrari-to-elevate-the-client-8217-::4e179049", "seq_no": 0, "text": "Salesforce, Ferrari Elevate the Client Experience with CRM, Agentforce - Salesforce\nSkip to Content\nSkip to Footer\n0%\nSalesforce Partners\nSalesforce Partners with Ferrari to Elevate the Client’s Journey Worldwide\nMay 28, 2025\n3 min read\nMedia Library\nMILAN — May 29, 2025‌ — Salesforce (NYSE: CRM), the world’s #1 CRM platform, is pleased to announce a new strategic partnership with Ferrari, focused on elevating the client experience, particularly through the deployment of its CRM technology for Ferrari sportscar clients and elevated through a marketing partnership with both Ferrari Hypercar and Ferrari Challenge Trofeo Pirelli motorsport activities.\nThis partnership will bring together both brands in a wide range of motorsport activities, including prestigious events and races worldwide. Salesforce will work closely with Ferrari to create unforgettable moments for customers and motorsport enthusiasts, further strengthening their global presence in the competitive racing arena.\nAt the core of this collaboration is the implementation of Salesforce’s advanced\nCustomer Relationship Management (CRM) system\n, which combines data, apps, and\nagents\nacross a deeply unified platform, and Agentforce — the proactive, agentic layer of the Salesforce Platform, which enables humans and agents to work together.\nThrough this partnership, Salesforce will provide its expertise to enhance the service provided to Ferrari sports car clients, helping to deliver a more personalized, responsive, and seamless experience for every customer. This innovative approach will allow Ferrari to engage with its clients in more meaningful ways, enhancing the overall ownership experience.\nBy harnessing Salesforce’s advanced technologies, Ferrari will gain a deeper, more comprehensive view of our clients, empowering us to make real-time, data-driven decisions.\nAlfonso Fuggetta, Chief Digital Transformation Officer at Ferrari\n“The partnership between Ferrari and Salesforce represents a significant step in redefining our approach to client engagement. By harnessing Salesforce’s advanced technologies, Ferrari will gain a deeper, more comprehensive view of our clients, empowering us to make real-time, data-driven decisions,” said Alfonso Fuggetta, Chief Digital Transformation Officer at Ferrari. “This will help ensure that every customer interaction – whether at a dealership or a racing event – is seamless, personalized, and reflective of our commitment to excellence. This collaboration sets a powerful example of how technology can elevate the customer journey.”\nThis collaboration sets a powerful example of how technology can elevate the customer journey.\nAlfonso Fuggetta, Chief Digital Transformation Officer at Ferrari\n“We are pleased to announce a partnership with Salesforce, a company which, like Ferrari, believes in innovation, technology, and teamwork,” said Lorenzo Giorgetti, Chief Racing Revenue Officer, Ferrari. “Over its 25-year history, Salesforce has acquired great experience in the field of CRM and I believe that this partnership that starts today will soon enable our company to offer its customers, both racing and others, a superior level of service.”\n“Salesforce is a proud partner of Ferrari Hypercar and Ferrari Challenge Trofeo Pirelli worldwide, providing innovative technologies and solutions for their sports car client service,” said Ariel Kelman, Chief Marketing Officer at Salesforce. “Ferrari can harness the full power of the\nSalesforce Platform\n— from apps and data to agents — unifying processes on a single technology platform to transform the customer journey and drive customer success.”\nLooking ahead, the partnership will expand into additional areas and will be aimed at broadening their collaboration to deepen the relationship with Ferrari clients. The collaboration will aim to improve customer satisfaction, engagement, and loyalty through innovative solutions that align with Ferrari’s values of performance and excellence, which have been achieved by customers using\nAgentforce\n.\nShare article\nJust For You\nAgentforce Boosts Salesforce Partner Support, Handling Over 19,000 Requests Since Inception\n5 min read\nAgents Unleashed: Interoperability to Power a $6 Trillion Economy\n3 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nAgentforce Boosts Salesforce Partner Support, Handling Over 19,000 Requests Since Inception\n5 min read\nAgents Unleashed: Interoperability to Power a $6 Trillion Economy\n3 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nCustomer Success\nSalesforce Partners\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nRelated Articles\nHow Salesforce’s Open Ecosystem Is Driving Trusted Agent Interoperability\n7 min read\nFrom Apps to Agents: How Agentic AI Will Bring the Next Great Wave of Business Innovation\n5 min read\nSalesforce Launches AgentExchange: the Trusted Marketplace for Agentforce\n8 min read\nSalesforce and Google Bring Gemini to Agentforce, Enable More Customer Choice in Major Partnership Expansion\n8 min read\nGet the latest Salesforce News\nSubscribe\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 907, "token_count": 1323, "start_char": 0, "end_char": 6368, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "2025-05-29", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/news/press-releases/2025/05/28/ferrari-agentforce-crm-elevates-client-experience/?bc=DB", "title": "Salesforce Partners with Ferrari to Elevate the Client&#8217;s Journey Worldwide", "company": "Salesforce", "persona_tags": ["cio"]}}
