{"chunk_id": "crm::press::2025-03-04::salesforce-launches-agentexchange-the-trusted-marketplace-fo::6a407410::chunk0000", "doc_id": "crm::press::2025-03-04::salesforce-launches-agentexchange-the-trusted-marketplace-fo::6a407410", "seq_no": 0, "text": "Salesforce unveils AgentExchange trusted marketplace for Agentforce - Salesforce\nSkip to Content\nSkip to Footer\n0%\nAgents\nSalesforce Launches AgentExchange: the Trusted Marketplace for Agentforce\nMarch 4, 2025\n8 min read\nMedia Library\nAgentExchange empowers partners, developers, and the Agentblazer community to build and monetize agentic AI components, fueling the next generation of businesses in the $6 trillion digital labor market\nAgentExchange includes more than 200 partners, including Google Cloud, Docusign, and Box, building trusted Agentforce solutions that businesses can use to rapidly build AI agents\nDevelopers can discover, try, and buy hundreds of prebuilt partner actions, topics, and templates on the marketplace or surfaced directly within Salesforce’s agent building tools\nSAN FRANCISCO – March 4, 2025 – Salesforce (NYSE: CRM), the #1 AI CRM, today launched\nAgentExchange\n, the trusted marketplace and community for\nAgentforce\nthat is built into Salesforce, opening up new opportunities for partners, developers, and Agentblazers to participate in the\nrapidly expanding $6 trillion\ndigital labor market.\nBuilding on the success of\nSalesforce AppExchange\n— the first and world’s largest enterprise cloud marketplace, which has grown to more than 13 million app installs — AgentExchange expands the capabilities and ecosystem of Agentforce, Salesforce’s\ndigital labor\nplatform.\nAgentExchange launches with more than 200 initial partners and hundreds of ready-made actions, topics, and templates that have passed rigorous security and customer reviews. Combined, these solutions will help organizations quickly create and deploy\nAI agents\nto improve productivity, efficiency, and innovation in any profession or industry.\n“Accelerating our speed of execution is critical to Goodyear’s ability to deliver for our customers and maximize our end-to-end value proposition. We’re excited about the potential of the ready-to-use solutions from AgentExchange to enhance our speed, efficiency, and customer experience,” shared Goodyear CEO and President Mark Stewart.\nWe’re excited about the potential of the ready-to-use solutions from AgentExchange to enhance our speed, efficiency, and customer experience.\nMark Stewart, CEO and President, Goodyear\nPartners are already building Agentforce components for AgentExchange. For example:\nGoogle Cloud:\nBuild\nAgentforce agents, grounded in Google Search\nvia Vertex AI and with the ability to reference up-to-the-minute data, news, and current events.\nBox:\nEnable Agentforce agents to extract insights from unstructured data and power actions with that information, using natural language to interact with content in Box.\nDocusign:\nGenerate agreements, route for signatures, track status, and gain key insights‌ — ‌automating workflows and boosting efficiency.\nWorkday:\nStreamline critical employee self-service workflows such as onboarding, benefits management, and career development, freeing up HR teams and significantly enhancing the employee experience.\n“When we launched AppExchange in 2005, it helped our customers get even more value from our platform with prebuilt apps, workflows, and integrations. It also gave our partners an opportunity to participate in the emerging cloud economy and build thriving businesses,” said Brian Landsman, EVP & GM, Global Business Development & Partnerships at Salesforce. “With AgentExchange, we’re doing much the same — opening up Agentforce for partners, startups, and Agentblazers to participate in the digital labor market and build agentic AI on Salesforce.”\n“AgentExchange empowers customers to seamlessly integrate trusted AI solutions within their workflow,” said Alice Steinglass, EVP & GM of Platform, Integration and Automation at Salesforce. “Now our developer community can directly tap the expertise of our partner ecosystem to get the right industry-specific solutions so they can build and implement AI agents, and be the pioneers turning their businesses into Agentforce companies.”\nBuild the future with Agentforce.\nEnterprise Automation Rewired: Meet the AI Agents Working Behind the Scenes\nFrom Zero to a Billion: Why Metadata Is Key to Building a Massive AI Agent Ecosystem\n92% of Developers Report AI Agents Will Help Advance Their Careers\nAgentforce Brings Vivint Customer Service Teams 24/7 Support\nNew AgentExchange and Agentforce features include:\nNew partner-built components:\nPartners and\nAgentblazers\ncan now offer four types of agentic components:\nActions:\nExpand the jobs agents built with Agentforce can do by adding new integrations — ranging from Apex, flows, APIs, and prompts — to tailor industry-specific components.\nPrompt templates:\nUse pre-written, reusable prompts that ensure consistent interactions and help agents gather information, assist users, and achieve specific goals.\nTopics:\nFocus and refine agent behavior by grouping actions and instructions around a single task or job. This helps to ensure agents deliver consistent results and stay within guardrails.\nAgent templates:\nDeliver comprehensive AI solutions by combining multiple topics and using the powerful actions partners have created, complete with metadata and global instructions that span across topics.\nEasily discover, try, and buy AI solutions:\nAgentExchange simplifies the process of finding and deploying the right trusted AI solutions. Customers can explore AgentExchange solutions directly on the marketplace or within Salesforce’s Agent Builder tool to identify the right solutions for their use case, product, or industry.\nUse standard and Slack actions:\nPartners and Agentblazers can now offer out-of-the-box Agentforce actions, including Slack, in packaged Agentforce topics and templates on the AgentExchange. These actions empower partner-delivered agents with built-in CRM and Slack capabilities, such as creating a case, canceling an order, updating a Slack canvas, searching Slack, or sending direct messages.\nAccess trusted, industry-specific agent solutions:\nAgentExchange connects businesses with Salesforce partners who have deep expertise in specific industries. Businesses can implement pre-built, customizable solutions that address unique challenges, accelerating AI adoption and maximizing its impact. Rigorous security reviews and customer feedback ensure trust in every solution listed on AgentExchange.\nCollaborate and innovate with Agentblazers:\nAgentExchange fosters a collaborative ecosystem where businesses, partners, and individual Agentblazers can connect, share best practices, and innovate together, accelerating the adoption of agentic AI.\n“AgentExchange unlocks new technology and markets for Docusign, expanding our reach and impact. We’ve worked closely with Salesforce to develop agent actions to seamlessly integrate them into our customers’ workflows. Our sales and service customers will now be able to leverage Agentforce and Docusign to automate common agreement-related tasks without the complexity of developing their own proprietary agentic technology,” said Larry Jin, VP Product Management, Docusign.\nAgentExchange solutions\nPartners who have AgentExchange listings or are actively developing Agentforce components include:\nSales & service\nAppiphony:\nOffers document generation fully integrated with Agentforce.\nBucher + Suter\n:\nEnables seamless escalation from agent to human within Agentforce, preserving context for smooth transitions.\nDocusign:\nGenerates documents, routes for signature, and tracks doc and signature status.\nHighspot\n: Provides Agentforce users with curated sales content and AI-powered analytics to increase buyer engagement and close more deals.\nNeuron 7\n:\nDirects enterprise service teams through optimal resolution paths for swift, accurate problem-solving.\nSalesWings\n:\nIntegrates customer intent data to enhance prospect engagement and sales performance.\nSeismic\n:\nDelivers AI-powered personalized content at scale from Salesforce, ensuring the right content for every opportunity stage and accelerating sales.\nTechSee\n:\nEmpowers sales, service, and field service teams with AI-driven visual intelligence to enhance remote assistance and customer support.\nFinance, operations, and talent\nAsymbl\n:\nOffers AI-powered recruiting solutions to streamline talent workflows.\nBullhorn\n:\nRecruitment Cloud Agents leverage over 90 actions to accelerate the entire recruiting lifecycle, improving key processes such as candidate matching, talent engagement, and hiring recommendations.\nCertinia:\nEnables managers to monitor a client’s health score, diagnose potential issues, and recommend remedies to customer issues.\nFinDock\n:\nIntegrates payment and CRM data, empowering payment agents.\nInvestorFlow\n: Simplifies prospect targeting and opportunity aggregation for financial deals.\nOpenText\n:\nAutomates document management, reducing storage costs and errors, for better efficiency and management.\nProductivity and collaboration\nBox:\nEnables Agentforce agents to extract insights from unstructured data and power actions with that information, using natural language to interact with content in Box.\nCloudCrossing\n:\nGenerates documents and launches digital signatures via agent actions.\nCoveo\n:\nEnables Agentforce agents with AI-driven relevance, securely retrieving the best answers from large, complex content repositories.\nCopado\n:\nStreamlines entire Salesforce DevOps process with intelligent automation for user story creation, release management, and deployment troubleshooting.\nFormstack\n:\nEmpowers agents to deliver ‘formless’ data collection, elevating customer interactions.\nGoMeddo\n:\nProvides AI-driven scheduling and booking within Salesforce, optimizing appointment management.\nHubbl:\nEmpowers agents with Hubbl Process Analytics and suggests best practices.\nMemberVerse\n:\nStreamlines operations with advanced workflow actions.\nMoody’s:\nLeverage agents in Agentforce to provide users with the most up-to-date account and company information from one of the world’s largest databases of private company information.\nPractivo\n:\nEnables natural language scheduling for appointments and resources, simplifying scheduling processes.\nSharinPix\n:\nEnables agents to search, view, and manage photos using content and metadata.\nTaskRay\n:\nStreamlines project management and task workflows with an AI assistant, improving team productivity and organization.\nZenkraft\n:\nEmpowers agents to provide seamless shipping, tracking, and returns support, leading to fewer customer inquiries and a more positive experience.\nIndustry-specific solutions\nHealthcare & Life Sciences\nComplianceQuest\n:\nAutomates audit observations for regulatory compliance, ensuring adherence to industry standards.\nDemandFarm\n:\nAutomates account plan creation, provides sales recommendations, and streamlines account research.\nManufacturing\nArpedio\n:\nOffers account insights, opportunity tracking, and sales suggestions for improved sales performance in manufacturing.\nPropel\n:\nStreamlines workflows by summarizing records, automating training, and enabling bulk item creation.\nRetail\n&\nHospitality\nThynk\n:\nAutomates proposal generation by centralizing key data points, like guest room availability and meeting space.\nVicasso\n:\nEnables surveys within Salesforce Messaging for real-time customer feedback and engagement.\nEducation\niSchoolConnect\n:\nLeverage AI actions to automate student enrollment.\nVisit AgentExchange and explore the Agentforce partner solutions available today on\nAgentExchange.Salesforce.com\n.\nAvailability\nAgentExchange is available today at\nAgentExchange.Salesforce.com\n.\nPackaging and Listing of Prompt Templates and Topics is available today.\nPackaging and Listing of Agent Templates will be available in April 2025.\nLearn more:\nVisit\nAgentExchange\nBecome an\nAgentblazer\nLearn more about the\nAgentforce Partner Network\nWatch the\nTDX keynote\nThis article may include references to services or features that are still in development and are unreleased. Customers should make their purchase decision based on fully released and available features.\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nDigital Transformation\nEnterprise AI\nSalesforce Partners\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Life Sciences Cloud Now Selected by More than 70 Industry-Leading Customers to Scale Engagement and Improve Patient Outcomes\n8 min read\nHow Agentic AI Can Help Overcome the Child Welfare Information Crisis\n8 min read\nManufacturers Gain New AI Workforce: Salesforce’s Agentforce for Manufacturing Optimizes Production, Boosts Sales, and Cuts Downtime\n7 min read\nHow a Texas Boomtown Used AI to Reinvent City Government\n8 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1972, "token_count": 2845, "start_char": 0, "end_char": 14367, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "2025-03-04", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/news/press-releases/2025/03/04/agentexchange-announcement/?bc=DB", "title": "Salesforce Launches AgentExchange: the Trusted Marketplace for Agentforce", "company": "Salesforce", "persona_tags": ["cio", "vp_customer_experience", "vp_sales_ops"]}}
