{"chunk_id": "crm::press::2024-09-12::about-salesforce-company::3ae394fc::chunk0000", "doc_id": "crm::press::2024-09-12::about-salesforce-company::3ae394fc", "seq_no": 0, "text": "Salesforce develops the technology, the partnerships, and the communities that help companies connect with customers. | Salesforce US\nSkip to content\nWe’re Salesforce,\nthe\n#1 AI CRM.\nSince we opened our doors in 1999, we’ve had a singular focus — helping our customers improve their customer relationships. We’ve been leaders in AI for over 10 years, fueling productivity for our customers so they can deliver exceptional experiences to their own. It’s no surprise, then, that over 150,000 companies worldwide now trust Salesforce to drive growth.\nWe're innovating our way into customers' hearts.\nMeet Agentforce. What AI was meant to be.\nBusinesses succeed when they create meaningful connection. Agentforce fuels connection, multiplying your workforce with autonomous agents that can serve customers round the clock and help your employees work better and faster. With specialized, customizable AI agents working together with humans across sales, service, marketing, commerce, and IT, it's easy to deliver amazing experiences that customers love.\nExplore Agentforce\nA history of firsts that put customers first.\n1999\nSalesforce opens its doors, pioneering software as a Service (SaaS) by bringing Customer Relationship Management software (\nCRM\n) to the cloud.\n2009\nService Cloud transforms customer service with unified customer information and automation.\n2012\nGartner ranks Salesforce #1 in CRM.\n2016\nEinstein is born, ushering in the AI CRM era with predictive insights and personalized recommendations.\n2024\nAgentforce defines a new era of customer engagement with autonomous agents that work 24/7, take action, and seamlessly hand off to humans.\nLearn about our products\nHelping customers succeed. It's a Salesforce thing.\nWiley\nOpenTable\nSaks\nFedEx\n\"Agentforce outperforms our old chatbot by over 40%.”\nKevin Quigley\nSenior Manager, CS Technology & Solutions, Wiley\nSee the Wiley story\nExplore all stories\n\"Service Cloud and Agentforce help us deliver effortless experiences that diners and restaurants love.\"\nGeorge Pokorny\nSenior Vice President of Global Customer Success, OpenTable\nSee the OpenTable story\nExplore all stories\n\"Agentforce will free up our people to work in a different way with our clients. It's not going to replace, it's going to augment.\"\nMark Metrick\nCEO, Saks Global\nSee the Saks story\nExplore all stories\nFedEx grows shipping revenue with unified B2B data in one view.\nData Cloud brings web, shipment, and account data together for more effective sales follow-up.\nSee the FedEx story\nExplore all stories\nEvery product we offer plays a part in building the connections that drive success — and that success can be harnessed to create positive change.\nWe are Trailblazers.\nWe’re not a typical company. And that’s by design. We call our community of Salesforce employees, customers, and partners \"Trailblazers.\" Trailblazers around the world reach across roles, companies, and industries to help one another learn, grow, and succeed.\nExplore Trailblazer Community\nDriven by our values.\nOur core values guide everything we do as a company and as people. Our mission is to bring out the best in one another, deliver success to our customers, and inspire the entire industry through our actions.\nIn trust we trust.\nTrust is our #1 value. We build trust with stakeholders by leading with ethics and through the integrity of our technology. We are dedicated to transparency, deep listening, and delivering on our commitments.\nStart building trust\nWhen our customers succeed, we succeed.\nSo we champion them to achieve extraordinary things. We innovate and expand our business offerings to provide our stakeholders with new avenues to achieve ever greater success.\nRead success stories\nSparking change with innovation.\nOur customers’ input helps us develop products that best serve their business needs. Providing continual technology releases and new initiatives gives them a competitive advantage.\nSee latest innovations\nEquality for all.\nWe believe everyone should be seen, heard, valued, and empowered to succeed. Hearing diverse perspectives fuels innovation, deepens connections between people, and makes us a better company.\nFollow our journey\nNet zero, now.\nWe lead boldly to address the climate emergency and accelerate the world's journey to net zero. We know that the wellbeing of our planet and our most vulnerable communities rests on a healthy climate.\nGo net zero now\nWe believe business is the greatest platform for change.\nWe are passionate proponents of stakeholder capitalism, committed to doing well by all our stakeholders — our customers, employees, partners, communities, the planet, and society as a whole. And we lead by example, spearheading initiatives in philanthropy, racial equality and justice, climate action and advocacy, and the ethical and humane use of technology.\nSee our values in action\nA win-win-win approach.\nOur founders launched the 1-1-1 model, which commits 1% of our equity, our technology, and our peoples’ time to improving education, equality, and the environment for everyone. Today, more than 18,000 companies worldwide have joined us in our Pledge 1% movement.\nTake the Pledge\nLearn more about us.\nCareers\nBe a part of the future of AI in business.\nFind Salesforce careers\nInvestor Relations\nLearn more about us and our financial results.\nExplore investor relations\nAwards and Recognition\nFocusing on customers has its rewards.\nSee all awards\nQuestions? We’ll put you on the right path.\nAsk about Salesforce products, pricing, implementation, or anything else. Our highly trained reps are standing by, ready to help.\nContact us", "word_count": 863, "token_count": 1146, "start_char": 0, "end_char": 5605, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/company/our-story/?bc=DB", "title": "Salesforce develops the technology, the partnerships, and the communities that help companies connect with customers.", "company": "Salesforce", "persona_tags": ["cio", "vp_sales_ops"]}}
