{"chunk_id": "crm::press::2024-08-10::marketing-cloud::7ce342b2::chunk0000", "doc_id": "crm::press::2024-08-10::marketing-cloud::7ce342b2", "seq_no": 0, "text": "Marketing Software by Salesforce Marketing Cloud | Salesforce US\nSkip to content\nSay hello to Marketing Cloud Next. The agentic marketing platform built for what’s next.\nLearn more.\nMeet the Next-Gen Marketing Cloud.\nSay goodbye to \"do-not-reply\" marketing. Marketing Cloud Next brings autonomous AI agents, actionable data, and full-funnel workflows together to power truly connected engagement.\nWatch demo\nLearn more\nLeading marketing teams of every size and every industry grow with Salesforce.\nWhat is Marketing Cloud Next?\nMarketing Cloud Next is a complete marketing platform designed to help you personalize every moment of engagement across the customer lifecycle. By connecting every department through actionable data and Agentforce, we empower teams to work together to build lasting customer relationships. No matter your tech stack, company size, or industry, Marketing Cloud Next can help you drive growth for your business.\nHow can Marketing Cloud help your business?\nUnlock trapped data\nPersonalize every moment in real-time with contextual data about each customer available at your fingertips.\nWatch now\nSave time with AI\nCreate impactful campaigns faster with Agentforce helping to surface insights, define strategy, and generate content.\nWatch now\nActivate anywhere\nDrive growth and loyalty with one platform for seamless engagement across the entire customer lifecycle.\nWatch now\nHere’s what sets Marketing Cloud apart.\n32\n%\nincrease in overall marketing ROI\n34\n%\nincrease in customer lifetime value\n32\n%\nincrease in customer engagement\n27\n%\ndecrease in cost to acquire new customers\n*Salesforce Customer Success Metrics\nDiscover why Marketing Cloud is the #1 agentic marketing platform.\nConnect Marketing to every department\nCreate, deploy & adapt campaigns faster with Agentforce\nPersonalize the right moment with actionable data\nConnect Marketing to every department\nEmail Marketing, Mobile, & Advertising\nIncrease conversion with relevant engagement across email, mobile, ads, and web.\nLearn more\nB2B Marketing Automation\nGrow revenue by aligning marketing and sales around every account.\nLearn more\nLoyalty Management\nIncrease profitability and loyalty with better engagement and personalized rewards.\nLearn more\nCreate, deploy & adapt campaigns faster with Agentforce\nMarketing AI\nOptimize every step of the campaign process with trusted, purpose-built AI.\nLearn more\nSmall Business Marketing\nGrow your small business faster with marketing automation on the Salesforce platform.\nLearn more\nPersonalize the right moment with actionable data\nCustomer Data Platform\nDrive growth with faster access to centralized data that's seamlessly activated to any channel.\nLearn more\nMarketing Analytics\nOptimize cross-channel campaigns and spend with a single view of your marketing performance.\nLearn more\nPersonalization\nDrive ROI and CLV with personalized experiences across every customer touchpoint.\nLearn more\nSee all Product Pricing\nSee how some of the world's biggest companies succeed with Marketing Cloud.\nSiriusXM\nFormula 1\nSiriusXM Engages the Next Generation of Listeners with Data Cloud\nWith Data Cloud and Marketing Cloud, SiriusXM harmonizes data across channels to create a 360-degree view of listeners. That way, they can personalize marketing experiences to keep subscribers engaged.\nWatch now\nFormula 1 boosts fan satisfaction to 88% by making every second count.\nWith a shared view of customer data and powerful real-time insights from Salesforce Data Cloud, sales, service, and marketing pros can delight fans with well-choreographed speed and consistency. Here’s how they do it.\nRead the story\nDiscover what's new in Marketing.\nInnovation\nContent\nAnalyst Reports\nWebinars\nDemo\nAgentforce for Marketing\nGenerate segments in real time, adapt experiences to every individual, and deliver personalized answers in every channel 24/7.\nWatch demo\nPress Release\nMeet Marketing Cloud Next\nTurn \"do-not-reply\" into real-time replies. Discover AI-powered, connected engagement with Marketing Cloud Next.\nLearn more\nDemo\nMeet Salesforce Personalization\nPower 1:1 experiences in real-time with Data and AI.\nWatch demo\nResearch\nState of Marketing Report\nSee the top trends in data, AI, and more — from nearly 5,000 marketers worldwide.\nGet the report\nGuide\nCDP Activation Guide\nLearn five ways to engage customers with unlocked data.\nGet the guide\nArticle\nConnecting Marketing and Service Experiences\nA unified marketing and service strategy can deliver more personalized customer journeys. Here's how to build yours.\nGet the guide\nArticle\nEngage across the customer lifecycle with Agentforce\nSee how agentic automation helps you build lasting customer relationships.\nRead the article\nReport\n2024 Gartner® Magic Quadrant™ for Multichannel Marketing Hubs\nDiscover why Gartner positioned us as a Leader in the 2024 Magic Quadrant for Multichannel Marketing Hubs.\nRead the report\nReport\nGartner® names Salesforce a CDP Leader two years in a row.\nLearn why Gartner named Salesforce a Leader among 12 other vendors.\nRead the report\nReport\n2024 Gartner® Magic Quadrant™ for B2B Marketing Automation Platforms\nSee why Gartner® named Salesforce a Leader for the seventh year in a row.\nRead the report\nWebinar\nGet Started with Agentforce for Marketing\nJoin our Marketing Cloud AI product leaders to discover how Agentforce for Marketing transforms AI insights into tangible actions, driving real enterprise value.\nWatch now\nWebinar\nUnlock the Power of First-Party Data with Salesforce and Meta\nDiscover how to enhance personalization and optimize marketing strategies through the partnership between Meta and Salesforce, leveraging innovations like the Data Cloud and Meta Conversions API.\nWatch now\nWebinar\nAI Driven Personalization: Learn how to Access and Activate your Data\nLearn how to leverage data for personalized customer engagement through customer stories focusing on data activation and personalization strategies.\nWatch now\nWebinar\nTransform your B2B Marketing Strategy with Data Cloud\nSee how Flexo Concepts transformed their B2B Marketing with Salesforce Account Engagement.\nWatch now\nJoin the Moment Marketer Community.\nLooking to meet and learn from fellow Marketing professionals? Our #MomentMarketer Community is the place for you.\nJoin the community\nExplore our content\nAchieve your AI and data goals with Salesforce CTOs.\nTrusted advisors with unmatched Salesforce experience and expertise, by your side.\nLearn more\nDiscover more about Marketing Cloud with free learning on Trailhead.\nReady to take the next step?\nTalk to an expert.\nTell us a bit more so the right person can reach out faster.\nRequest a call\nStay up to date.\nSalesforce Marketing Cloud FAQ\nWhat is Marketing Cloud Next?\nMarketing Cloud Next is a complete marketing platform designed to help you personalize every moment of engagement across the customer lifecycle. By connecting every department through actionable data and Agentforce, we empower teams to work together to build lasting customer relationships. No matter your tech stack, company size, or industry, Marketing Cloud Next can help you drive growth for your business.\nWhat does Marketing Cloud Next do?\nMarketing Cloud Next brings agentic marketing to life by giving every customer access to autonomous AI agents that act as always-on collaborators, generate segments in real time, adapt experiences to every individual, and deliver personalized answers in every channel—24/7.\nUnstructured data is AI-ready with Data Cloud to unify PDFs, videos, CMS, and more to power automation, real-time analytics, and Agentforce —turning content into a live knowledge base.\nThe end of one-way marketing is here. With Agentforce embedded across email, SMS, and web, “do-not-reply” messages become two-way customer conversations across channels and departments - connecting marketing with sales, service, and commerce.\nCampaigns can now assemble and optimize themselves in Marketing Cloud Next. Deploy campaigns in hours, not weeks with always-on execution, performance monitoring, & real-time optimization based on the marketer’s goals and guidelines.\nWhat is Agentic Marketing?\nPowered by agentic AI, agentic marketing puts autonomous AI agents to work — personalizing and connecting experiences across every touchpoint. Unlike traditional automation, marketers define the strategy — such as “increase loyalty among at-risk customers” — and AI agents handle the execution. They create content, build audiences, personalize messaging, optimize performance, and even manage handoffs between teams and channels. So instead of juggling tools and chasing approvals, marketers get time back for what really matters: strategy, creativity, and driving growth.\nWhat is Agentforce for Marketing?\nAgentforce\nis a type of\nartificial intelligence (AI)\napplication designed to execute specialized tasks to help marketers and customers. Agentforce for Marketing Cloud offers marketers pre-built skills to streamline key marketing tasks such as planning and creating marketing campaigns - Agentforce can help marketers create a brief, target audience segment, email and SMS content, build a customer journey in Flow, and even provide a campaign summary! For more specialized needs, marketers can create custom agents using Agent Builder.\nWhat is marketing software?\nChoosing the right marketing software involves considering several key factors. Start by identifying your specific marketing needs and goals. Evaluate the features and capabilities of different software options, ensuring they align with your requirements. Consider factors such as ease of use, scalability, integration with existing systems, and customer support. Take advantage of demos to assess its user-friendliness. Read reviews, seek recommendations, and consider the reputation and track record of the software provider. Pay attention to data security, privacy, and compliance with regulations. Finally, evaluate the cost and value proposition to ensure the software fits within your budget and offers a strong return on investment. By carefully assessing these factors, you can choose the marketing software that best suits your business needs.\nDoes my business need marketing software?\nIf you run\ndigital marketing\ncampaigns across multiple channels, marketing software can greatly benefit your business through automation, personalization, and\ndata-driven marketing\ndecision-making. Marketing software streamlines processes, improves productivity, enables personalized customer experiences, and provides valuable insights for optimizing marketing strategies. It helps businesses stay competitive in today's digital landscape and grow more efficiently. Assess your marketing needs, resources, and goals to determine which marketing software is most valuable to your business objectives.\nHow do I choose the right marketing software?\nChoosing the right marketing software involves considering several key factors. Start by identifying your specific marketing needs and goals. Evaluate the features and capabilities of different software options, ensuring they align with your requirements. Consider factors such as ease of use, scalability, integration with existing systems, and customer support. Take advantage of demos to assess its user-friendliness. Read reviews, seek recommendations, and consider the reputation and track record of the software provider. Pay attention to data security, privacy, and compliance with regulations. Finally, evaluate the cost and value proposition to ensure the software fits within your budget and offers a strong return on investment. By carefully assessing these factors, you can choose the marketing software that best suits your business needs.\nUnlock trapped data\nPersonalize every moment in real-time with contextual data about each customer available at your fingertips.\nSave time with AI\nCreate impactful campaigns faster with Agentforce helping to surface insights, define strategy, and generate content.\nActivate anywhere\nDrive growth and loyalty with one platform for seamless engagement across the entire customer lifecycle.", "word_count": 1748, "token_count": 2257, "start_char": 0, "end_char": 12085, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "url": "https://www.salesforce.com/marketing/?bc=DB", "title": "Build better relationships that drive growth with Marketing Cloud", "company": "Salesforce", "persona_tags": ["cio", "vp_sales_ops"]}}
