{"chunk_id": "crm::press::2024-08-15::salesforce-careers::4964b777::chunk0000", "doc_id": "crm::press::2024-08-15::salesforce-careers::4964b777", "seq_no": 0, "text": "Salesforce Careers | Build the Future of AI with Us | Salesforce US\nSkip to content\nBe limitless in the\nagentic era.\nAt Salesforce, we’re not just shaping the future. We’re turning big ideas into breakthroughs. At the world’s trusted #1 AI CRM, humans and AI agents collaborate to drive efficiency, growth, and workforce transformation.\nOur values are our superpower. We’re purpose-driven high performers, lifelong learners, and innovators shaping what’s next in AI. Ready to solve challenges with agents and lead with impact?\nSearch jobs\nJoin our Talent Community\nWe're trailblazing, innovating,\nand award-winning.\nWe're one of the fastest-growing enterprise software companies and a leader in values, philanthropy, and agent-centric innovation.\nDiscover your dream team.\nWhether you're coding our next agentic AI innovation or driving success for our customers, you'll find your fit here on one of our high-impact teams. Learn more about the roles that we are actively hiring for:\nSales\nAs a trusted partner, you won’t just sell AI agents. You’ll work alongside them to accelerate revenue, from pipeline to your paycheck. Guide customers of every size and industry to reimagine their business with the #1 AI CRM.\nLearn more\nTech & Product\nWhat if your tool set was unlimited? And you were invited to build tomorrow’s solutions with AI and scale in mind? Take a look at our technology and product (T&P) teams. Join the pros that shape the future of AI.\nLearn more\nCustomer Success\nWe’re called the customer company for a reason. Our Customer Success teams help companies soar. From nonprofits to enterprise organizations, we help our customers reimagine their\nbusiness, so they can connect with\ntheir\ncustomers in a whole new way.\nLearn more\nCorporate Roles\nFrom driving smart decisions in finance to supporting our people in employee success, building our brand in marketing, or streamlining systems in operations, our corporate roles have a direct hand in helping the company scale, move fast, and stay values-driven.\nLearn more\nBusiness is the greatest platform for change.\nAt Salesforce, we believe business is a powerful platform for creating meaningful, positive change in the world. We're not just building products; we’re building a better future, one where innovation and values go together. Here’s what this means:\nUsing innovation\nfor impact.\nWe’re committed to using Technology to solve some of our customers’ most pressing challenges. From AI-driven solutions to sustainability, we innovate to benefit both our customers and society at large.\nLearn more\nYou + agents = Customer Success.\nYou won’t just hear about AI agents, you’ll work alongside them. Giving you time back to do what you do best: innovating, elevating, and driving Customer Success. And it all starts with becoming an Agentblazer.\nLearn more\nBusiness creates real change.\nBusiness is the greatest platform for change, where every interaction and solution can drive positive impact. With equality as a core value, we're on a journey to bring everyone along in the agentic era.\nLearn more\nPerform your best —  in all areas of your life\nWhen you join Salesforce, you’ll harness the power of Agentforce to accelerate your career\nand\nprioritize your wellbeing. Our world-class benefits help you to prioritize, well, you. And your family.\nLearn more\nLearn about life at Salesforce\nWhat energizes me most at Salesforce is being surrounded by people who turn big challenges into even bigger opportunities. It's innovative, supportive, and you can feel the impact of your work.\nAlexander Matarazzo\nECS Account Executive, United States\nConnect and collaborate around the world.\nWhether you’re customer-facing, collaborating in person across our global offices, or on Slack, we connect in ways that work best for our people and teams. See some of our locations:\nNorth America\nLearn more\nEurope, Middle East, and Africa\nLearn more\nAsia Pacific and India\nLearn more\nLatin America\nLearn more\nLearn more about life at Salesforce.\nAt Salesforce, your career is a journey of growth, innovation, and impact. Learn more about life at Salesforce through our blogs, upcoming events, and on-demand webinars.\nCareer Growth\nA MuleSoft Leader's Journey to London & Advice for Aspiring Account Executives\nPivoting to tech sales? Discover how Hayal went from banking to Salesforce AE to RVP of Sales — and what she looks for when hiring.\nLearn more\nArtificial Intelligence\nSelling Smarter: How Salesforce Uses Agentic AI to Boost Seller Productivity\nLearn about the incredible journey of Jenny, a leader at the forefront of our agentic AI transformation and how her team is empowering sellers with Agentforce.\nLearn more\nArtificial Intelligence\nTechnical Architecture in the Age of Agentic AI: Building What’s Next\nInside Garima's world, every solution is a puzzle, every integration is a critical link, and every decision shapes the future of intelligent systems. Learn her take on agentic AI as a Technical Architect at Salesforce.\nLearn more\nExplore more\nWe can't wait to connect with you.\nReady to take the next step? Apply today or join our Talent Community to stay in the loop on open roles, career tips, insider updates, and events near you. When the right opportunity pops up — you’ll be the first to know.\nApply today\nJoin our Talent Community\nAt Salesforce, we strive to create an accessible and inclusive experience for all candidates.\nIf you need a reasonable accommodation during the application or the recruiting process, please submit a request via this\nAccommodation Request Form\n. Please note that Salesforce uses an automated employment decision tool to help our recruiters assess and evaluate candidates’ resumes. If you do not want Salesforce to use this tool with your application, please submit a request via\nthis form\n.\nEqual Opportunity Statement.\nAt Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at\nwww.equality.com\nand explore our company benefits at\nwww.salesforcebenefits.com\n.\nSalesforce is an equal opportunity employer and maintains a policy of non-discrimination with all employees and applicants for employment. What does that mean exactly? It means that at Salesforce, we believe in equality for all. And we believe we can lead the path to equality in part by creating a workplace that’s inclusive, and free from discrimination.\nKnow your rights: workplace discrimination is illegal\n. Any employee or potential employee will be assessed on the basis of merit, competence and qualifications – without regard to race, religion, color, national origin, sex, sexual orientation, gender expression or identity, transgender status, age, disability, veteran or marital status, political viewpoint, or other classifications protected by law. This policy applies to current and prospective employees, no matter where they are in their Salesforce employment journey. It also applies to recruiting, hiring, job assignment, compensation, promotion, benefits, training, assessment of job performance, discipline, termination, and everything in between. Recruiting, hiring, and promotion decisions at Salesforce are fair and based on merit. The same goes for compensation, benefits, promotions, transfers, reduction in workforce, recall, training, and education.\nSalesforce welcomes all.\nIn the United States, compensation offered will be determined by factors such as location, job level, job-related knowledge, skills, and experience. Certain roles may be eligible for incentive compensation, equity, and benefits. More details about our company benefits can be found at the following link:\nhttps://www.salesforcebenefits.com\n.", "word_count": 1233, "token_count": 1588, "start_char": 0, "end_char": 7939, "local_heads": [], "metadata_snapshot": {"doctype": "press", "date": "", "topic": "Agentforce|Earnings|Partnership|Product", "url": "https://www.salesforce.com/company/careers/?bc=DB", "title": "Careers at Salesforce | Be Part of What’s Next", "company": "Salesforce", "persona_tags": ["cio", "vp_sales_ops"]}}
