{"doc_id": "crm::press::2024-02-28::salesforce-legal::c00cb576", "company": "Salesforce", "doctype": "press", "title": "Legal", "publish_date": "", "url": "https://www.salesforce.com/company/legal/?bc=DB", "final_url": "https://www.salesforce.com/company/legal/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Earnings|Partnership|Product", "persona_tags": ["general"], "language": "en", "text": "Legal | Salesforce US\nSkip to content\nSalesforce Legal\nFind legal information and resources whether you are a prospective or existing customer, partner or service provider. You'll find answers to questions about our agreement terms, policies, intellectual property, and compliance, as well as how we uphold Trust as our #1 value.\nFind content relevant to you.\nFor Customers\nLearn more about the terms associated with the purchasing of Salesforce products.\nSee more\nFor Partners and Alliances\nFind documentation and information regarding partner and alliances agreements.\nSee more\nFor Suppliers\nGet information and documentation around Salesforce's relationships and agreements with Suppliers.\nSee more\nExplore policies and other documentation.\nPrivacy Information\nFind resources and documentation on how Salesforce protects you and your information.\nSee more\nIntellectual Property\nSee how Salesforce protects its intellectual property on\ntrademark and copyright usage\nor learn how to submit\ni\nnfringement claims.\nSee DMCA Policy\nCompliance\nGet information and documentation around how Salesforce maintains compliance with local and international laws, as well as\naccessibility\n. Learn about how Salesforce ensures innovation is balanced with ethical use\nhere\n.\nSee more\nAt Salesforce, Trust has always been our #1 value and the cornerstone of our business. From ensuring data privacy and protection to responsible and ethical product innovation, trust underscores everything we do.\nSabastian Niles\nPresident and Chief Legal Officer , Salesforce\nTrending Topics\nArticle\nHow Salesforce Builds Trust in Our AI Products\nSalesforce is taking steps to ensure AI is trusted and reliable by empowering humans at the helm through product design AI holds incredible promise for.\nLearn more\nArticle\nAutonomous AI Agents Are Coming: Why Trust and Training Hold the Keys to Their Success\nAutonomous AI agents are coming to workplaces sooner than you might think. Count on them automating routine and complex tasks.\nLearn more\nArticle\nSalesforce Named to World’s Most Ethical Companies List for 15th Time\nThe Ethisphere Institute, a global leader in defining and measuring corporate ethical standards of business practices, has again recognized Salesforce as one of the World’s Most Ethical Companies™.\nLearn more\nQuestions? Get in Touch.\nAsk about Salesforce products, pricing, implementation, or anything else. Our highly trained reps are standing by, ready to help.", "word_count": 365, "token_count": 466, "ingestion_ts": "2025-09-07T04:08:41.895599", "hash_sha256": "06131f0861ae447fa28064785a969c6c55a9f6cfa39081d0e7e2a829d41fd966", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "missing", "publish_date_confidence": 0.0, "was_fallback_today": false}