{"doc_id": "crm::press::2025-02-26::salesforce-announces-fourth-quarter-and-fiscal-year-2025-res::eec1d5f8", "company": "Salesforce", "doctype": "press", "title": "Salesforce Announces Fourth Quarter and Fiscal Year 2025 Results", "publish_date": "2025-02-26", "url": "https://www.salesforce.com/news/press-releases/2025/02/26/fy25-q4-earnings/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/02/26/fy25-q4-earnings/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Salesforce Announces Fourth Quarter and Fiscal Year 2025 Results - Salesforce\nSkip to Content\nSkip to Footer\n0%\nEarnings\nSalesforce Announces Fourth Quarter and Fiscal Year 2025 Results\nFebruary 26, 2025\n4 min read\nDownload Assets\nMedia Library\nTotal Remaining Performance Obligation $63B, up 11% Y/Y; Operating Cash Flow $13B, up 28% Y/Y\nSAN FRANCISCO —\nFebruary 26, 2025 –\nSalesforce (NYSE: CRM), the world’s #1 AI CRM, today announced results for its fourth quarter and full fiscal year ended January 31, 2025.\nFY25 Agentforce & Data Cloud\n$900 million Data Cloud & AI annual recurring revenue, up 120% year-over-year (“Y/Y”)\nSince October, closed 5,000 Agentforce deals, including more than 3,000 paid\nData Cloud surpassed 50 trillion records, which doubled Y/Y\nNearly half of the Fortune 100 are both AI & Data Cloud customers, and all of our top 10 wins in Q4 included Data and AI\nOn help.salesforce.com, Agentforce has handled 380,000 conversations, achieving an 84% resolution rate, with only 2% of the requests requiring human escalation\nFY25 Results\nFourth quarter revenue of $10.0 billion, up 8% Y/Y, up 9% in constant currency (“CC”), inclusive of subscription & support revenue of $9.5 billion, up 8% Y/Y, up 9% in CC\nCurrent remaining performance obligation of $30.2 billion, up 9% Y/Y, up 11% in CC\nTotal remaining performance obligation of $63.4 billion, up 11% Y/Y\nFY25 revenue of $37.9 billion, up 9% both Y/Y & in CC, inclusive of subscription & support revenue of $35.7 billion, up 10% both Y/Y & in CC\nFY25 GAAP operating margin of 19.0% and non-GAAP operating margin of 33.0%\nFY25 operating cash flow of $13.1 billion, up 28% Y/Y, and free cash flow of $12.4 billion, up 31%\nY/Y\nReturned $7.8 billion in the form of share repurchases and $1.5 billion in dividend payments to stockholders; total cash returned to stockholders of $9.3 billion in FY25\nFull Year FY26 Guidance\nInitiates revenue guidance of $40.5 billion to $40.9 billion, up 7% – 8% both Y/Y & in CC\nInitiates subscription & support revenue growth guidance of approximately 8.5% Y/Y & approximately 9% in CC\nInitiates GAAP operating margin guidance of 21.6% and non-GAAP operating margin guidance of 34.0%\nInitiates operating cash flow growth guidance of approximately 10% to 11% Y/Y\n“We had an incredible quarter and year, with strong performance across all our key metrics, including the highest cash flow in our company’s history and more than $60 billion in RPO,” said Marc Benioff, Chair and CEO, Salesforce. “No company is better positioned than Salesforce to lead customers through the digital labor revolution. With our deeply unified platform, seamlessly integrating our Customer 360 apps, Data Cloud and Agentforce, we’re already delivering unprecedented levels of productivity, efficiency and cost savings for thousands of companies.”\nNo company is better positioned than Salesforce to lead customers through the digital labor revolution.\n“We closed out the year with strong results and our relentless focus on profitable growth drove record-breaking revenue, margin, and cash flow, setting a strong foundation for the company into FY26” said Amy Weaver, President and CFO. “Our capital return program continued to deliver incredible value to our shareholders, returning $21 billion since inception.”\nGuidance\nOpen Image Modal\nImage Modal\nThe following is a reconciliation of GAAP operating margin guidance to non-GAAP operating margin guidance for the full year:\nOpen Image Modal\nImage Modal\nThe following is a per share reconciliation of GAAP diluted net income per share to non-GAAP diluted net income per share guidance for the next quarter and the full year:\nOpen Image Modal\nImage Modal\nFor additional information regarding non-GAAP financial measures see the reconciliation of results and related explanations below.\nManagement will provide further commentary around these guidance assumptions on its earnings call.\nProduct Releases and Enhancements\nThree times a year Salesforce delivers new product releases, services, or enhancements to current products and services. These releases are a result of significant research and development investments made over multiple years, designed to help customers drive cost savings, boost efficiency, and build trust.\nTo learn more about our newest innovations and product release highlights, including our latest Spring 2025 Product Release, visit: www.salesforce.com/releases.\nEnvironmental, Social, and Governance (ESG) Strategy\nTo learn more about our latest initiatives and priorities, review our Stakeholder Impact Report: https://salesforce.com/stakeholder-impact-report.\nQuarterly Conference Call\nSalesforce plans to host a conference call at 2:00 p.m. (PT) / 5:00 p.m. (ET) to discuss its financial results with the investment community. A live webcast and replay details of the event will be available on the Salesforce Investor Relations website at www.salesforce.com/investor.\nShare article\nJust For You\nSalesforce Reports Record Second Quarter Fiscal 2026 Results\n4 min read\nSalesforce Reports Record First Quarter Fiscal 2026 Results Exceeds Guidance Across All Metrics; cRPO up 12% Y/Y\n5 min read\nShare article\nJust For You\nSalesforce Reports Record Second Quarter Fiscal 2026 Results\n4 min read\nSalesforce Reports Record First Quarter Fiscal 2026 Results Exceeds Guidance Across All Metrics; cRPO up 12% Y/Y\n5 min read\nExplore related content by topic\nEarnings\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nRelated Articles\nSalesforce Announces Second Quarter Fiscal 2025 Results\n4 min read\nSalesforce Announces First Quarter Fiscal 2025 Results\n4 min read\nSalesforce Announces Strong Fourth Quarter Fiscal 2024 Results\n6 min read\nSalesforce Announces Strong Third Quarter Fiscal 2024 Results\n4 min read\nGet the latest Salesforce News\nSubscribe\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1044, "token_count": 1648, "ingestion_ts": "2025-09-06T21:57:16.819132", "hash_sha256": "6636ef22669f61218c8839fed6a3b2d920e6a1aa8b5143328ed2736ae2ae6226", "html_title": "", "meta_published_time": "2025-02-26", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false, "link_ok": true, "link_status": 200}