{"doc_id": "crm::press::2025-02-23::environmental-social-and-governance-esg::d4f786ad", "company": "Salesforce", "doctype": "press", "title": "Salesforce.com, Inc. - Environmental, Social, and Governance (ESG)", "publish_date": "2025-02-23", "url": "https://investor.salesforce.com/esg/default.aspx", "final_url": "https://investor.salesforce.com/esg/default.aspx", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Partnership|Product", "persona_tags": ["cio"], "language": "en", "text": "Salesforce.com, Inc. - Environmental, Social, and Governance (ESG)\nSkip to main content\nEnvironmental, Social, and Governance (ESG)\nWe believe that focusing on environmental, social, and governance (ESG) excellence guides us in being an ethical, resilient company to deliver value to our stakeholders now and in the future.\nWe believe the business of business is to make the world a better place for all of our stakeholders, including stockholders, customers, employees, partners, the planet and the communities in which we work and live. Our ESG objectives align with our long-term profitable growth strategy, as well as financial and operational priorities. To that end, Salesforce is committed to transparent ESG disclosures and maintaining programs that support the success of these initiatives.\nSalesforce believes that a just transition to a net zero and nature-positive future will create better outcomes for our business, the economy, communities and the world at large. We maintain net zero residual emissions across our full value chain*, and 100% renewable energy for our global operations**.\nOur longstanding value of equality is a competitive edge for our business, helping us to innovate and grow by reflecting our full range of customers, attracting top talent, and including all perspectives as we create the technology that shapes our world.\nWe support upskilling our workforce to thrive in an agent-first enterprise, and work to bring our ecosystem along in the agentic future with Trailhead and partnerships with companies and nonprofits.\nWe pioneered the 1-1-1 integrated philanthropy model, by pledging 1% of our equity, 1% of our time and 1% of our product to give back to our communities. Over 19,000 companies from over 100 countries have joined us in the Pledge 1% movement.\nWe ensure Salesforce technologies are designed, developed, and used in an ethical, accessible, and inclusive way. We champion Intentional Innovation that considers unintended consequences in product and policy and aims to prevent harm and create better product experiences for everyone, including frameworks for developing and using our AI products responsibly and ethically.\n*Net zero means net zero residual emissions (purchasing carbon credits equivalent to our residual scope 1, 2, and 3 emissions on an annual basis).\n**100% renewable energy means procuring renewable energy and/or renewable energy certificates equivalent to the electricity we use globally on an annual basis.\nPractices\nDownload item year list\n2025\nDate\nDownload\nDescription\nFebruary 23, 2025\nEnvironmental Sustainability\n(opens in new window)\nFebruary 19, 2025\nEthical and Humane Use\n(opens in new window)\nFebruary 17, 2025\nPhilanthropy\n(opens in new window)\nFebruary 15, 2025\nTrusted AI\n(opens in new window)\nFebruary 13, 2025\nWorkforce Development\n(opens in new window)\nFebruary 11, 2025\nBenefits\n(opens in new window)\nPolicies and Additional Reports\nDownload item year list\n2025\nDate\nDownload\nDescription\nFebruary 25, 2025\nGlobal Environmental Policy\n(opens in new window)\n109 KB\nFebruary 21, 2025\nHuman Rights Principles\n(opens in new window)\nFebruary 19, 2025\nAcceptable Use Policy\n(opens in new window)\n84 KB\nFebruary 17, 2025\nEthical Use Policy\n(opens in new window)\nFebruary 15, 2025\nHealth & Safety Policy\n(opens in new window)\n71 KB\nFebruary 13, 2025\nFY25 Stakeholder Impact Report\n(opens in new window)\nFebruary 11, 2025\nFY25 Schedules of Selected Environmental and Employee Metrics\n(opens in new window)\n378 KB\nSustainable Bond Reports\nDownload item year list\n2025\nDate\nDownload\nDescription\nFebruary 25, 2025\nSustainable Bond Framework\n(opens in new window)\n429 KB\nFebruary 23, 2025\nSustainability Bond Report\n(opens in new window)\n739 KB\nRecognition\nWe are honored to be recognized by organizations and media around the world for our ESG commitments and initiatives to be a great place to work. Below are some of our most recent awards.", "word_count": 608, "token_count": 882, "ingestion_ts": "2025-09-06T21:57:14.163827", "hash_sha256": "8d2119bbe187d6d7503d1392abab2cd6bebcfeb05110c551dab4266b738d77b5", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "investor.salesforce.com", "publish_date_provenance": "visible_dateline", "publish_date_confidence": 0.8, "was_fallback_today": false, "link_ok": false, "link_status": 403}