{"doc_id": "crm::press::2025-05-27::salesforce-signs-definitive-agreement-to-acquire-informatica::54832fce", "company": "Salesforce", "doctype": "press", "title": "Salesforce Signs Definitive Agreement to Acquire Informatica", "publish_date": "2025-05-27", "url": "https://www.salesforce.com/news/press-releases/2025/05/27/salesforce-signs-definitive-agreement-to-acquire-informatica/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/05/27/salesforce-signs-definitive-agreement-to-acquire-informatica/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Salesforce Signs Definitive Agreement to Acquire Informatica - Salesforce\nSkip to Content\nSkip to Footer\n0%\nMergers and Acquisitions\nSalesforce Signs Definitive Agreement to Acquire Informatica\nMay 27, 2025\n11 min read\nMedia Library\nSAN FRANCISCO/REDWOOD CITY, CA — May 27, 2025\n—\nSalesforce (NYSE: CRM), the world’s #1 AI CRM, and Informatica (NYSE: INFA), a leader in enterprise AI-powered cloud data management, have entered into an agreement for Salesforce to acquire Informatica for approximately $8 billion in equity value, net of Salesforce’s current investment in Informatica. Under the terms of the agreement, holders of Informatica’s Class A and Class B-1 common stock will receive $25 in cash per share.\nThe planned acquisition will enhance Salesforce’s trusted data foundation critical for deploying powerful and responsible\nagentic AI\n. The combination of Informatica’s rich data catalog, data integration, governance, quality and privacy, metadata management, and Master Data Management (MDM) services with the Salesforce platform will establish a unified architecture for agentic AI — enabling\nAI agents\nto operate safely, responsibly, and at scale across the modern enterprise.\nEffective, enterprise-grade AI requires more than just data — it demands data transparency, deep contextual understanding, and rigorous governance:\nData Transparency:\nInformatica’s advanced integration, catalog, and lineage tools show where data comes from, how it has changed, and how it is used — crucial for auditability and regulatory compliance.\nData Understanding:\nInformatica’s rich metadata, combined with Salesforce’s unified data model, will empower AI agents to interpret, connect, and act on enterprise data with meaningful context.\nData Governance:\nBuilt-in MDM, data quality controls, and policy management ensure that all data driving AI is standardized, accurate, consistent, and secure.\nThis is a transformational step in delivering enterprise-grade AI that is safe, responsible, and deeply integrated with the world’s data,”\nsaid Marc Benioff, Chair and CEO of Salesforce.\n“We’re excited to acquire Informatica for approximately $8 billion — uniting the world’s #1 AI CRM with the #1 AI-powered MDM and ETL platform,”\nsaid Marc Benioff, Chair and CEO of Salesforce.\n“This combination brings together Salesforce’s Einstein and Informatica’s CLAIRE AI engines to forge the ultimate AI-data platform — trusted, explainable, and built to scale. Together, we’ll supercharge\nAgentforce\n,\nData Cloud\n,\nTableau\n,\nMuleSoft\n, and\nCustomer 360\n, enabling autonomous agents to act with intelligence, context, and confidence across every enterprise. This is a transformational step in delivering enterprise-grade AI that is safe, responsible, and deeply integrated with the world’s data.”\n“Joining forces with Salesforce represents a significant leap forward in our journey to bring ​​data and AI to life by empowering businesses with the transformative power of their most critical asset — their data,”\nsaid Amit Walia, CEO of Informatica.\n“We have a shared vision for how we can help organizations harness the full value of their data in the AI era.”\nUnlocking the Full Value of Enterprise Data Across Salesforce\nBringing together Informatica’s cloud-native capabilities — including its extensive data catalog, data integration, governance, quality and privacy, metadata management, and MDM — with the Salesforce platform will unlock new capabilities for Salesforce’s enterprise data stack, delivering a complete solution to the challenges of AI at scale, by:\nAchieving Data Clarity with Data Cloud:\nInformatica will strengthen Data Cloud’s leadership as a\nCustomer Data Platform (CDP)\n, ensuring data from across the organization is not just unified but clear, trusted, and actionable.\nElevating Agentforce:\nCombined, Informatica and Salesforce will provide a critical foundation for autonomous AI agents to interpret and act on complex enterprise data, building a true system of intelligence on a trusted system of understanding.\nAugmenting the Customer 360:\nSalesforce\nCRM\napplications will be enhanced, giving teams the confidence to deliver more personalized and effective customer experiences, backed by trusted data.\nGoverned Understanding for MuleSoft:\nInformatica’s advanced data quality, integration, cataloging, and governance will ensure data flowing through MuleSoft APIs is not just connected but also enriched, standardized, and trustworthy — a reliable stream ready to fuel AI-powered decisions and actions across the enterprise.\nContext-Rich Insights for Tableau:\nTableau users will benefit from richer, context-driven insights thanks to a more accessible and better-understood data landscape.\nDelivering this level of value requires more than a partnership — it demands deep, native integration of Informatica technology within the Salesforce platform.\n“Truly autonomous, trustworthy AI agents need the most comprehensive understanding of their data. The combination of Informatica’s advanced catalog and metadata capabilities with our Agentforce platform delivers exactly this,” said\nSteve Fisher, President and Chief Technology Officer, Salesforce.\n“Imagine an AI agent that goes beyond simply seeing data points to understand their full context — origin, transformation, quality, and governance. This clarity, from a unified Salesforce and Informatica solution, will allow all types of businesses to automate more complex processes and make more reliable AI-driven decisions.”\nUpon close, Salesforce plans to rapidly integrate Informatica’s technology stack — including data integration, quality, governance, and unified metadata for Agentforce, and a single data pipeline with MDM on Data Cloud — seamlessly embedding this “system of understanding” into the Salesforce ecosystem.\nSalesforce will also support Informatica’s continued strategy of building best-in-class, AI-powered data management products — delivering a complete, end-to-end platform with industry-leading, integrated solutions to connect, manage, and unify data across any cloud, hybrid, or multi-cloud environment.\nInvesting in the Future of AI-Powered Customer Success\nThe proposed acquisition — pursued with strategic clarity and financial discipline, and aligned to Salesforce’s responsible M&A framework — and the rapid integration of Informatica’s premier data management capabilities with Data Cloud is a timely opportunity to further Salesforce’s leadership in the AI revolution.\n“Our acquisition strategy is methodical, patient, and decisive — targeting transformative assets like Informatica when the calculus aligns to maximize customer success,” said\nRobin Washington, President & Chief Operating and Financial Officer, Salesforce.\n“This proposed acquisition will be a key enabler for Salesforce’s next phase of AI-driven growth — and we will move quickly to integrate their capabilities and unlock synergies on a fast timeline, particularly in areas like Public Sector, Life Sciences, Healthcare, and Financial Services. We’re laser-focused on accelerated execution to increase our market differentiation and deliver sustained benefits for all Salesforce stakeholders.”\n“Permira and CPP Investments partnership with Informatica is clear proof of the benefits of a long-term investing mindset and focus on transformational growth at scale,”\nsaid Bruce Chizen, Informatica Chairman.\n“This exceptional outcome with Salesforce is testament to that philosophy.”\nSalesforce plans to invest in Informatica’s ecosystem of data and infrastructure partners and apply the full power of Salesforce’s marketing and distribution teams to accelerate the growth of Informatica’s cloud business.\nTransaction Details\nUnder the terms of the agreement, Salesforce will acquire all outstanding shares of common stock of Informatica that it does not already own. The transaction has been approved by the boards of directors of both Salesforce and Informatica and is expected to close early in Salesforce’s fiscal year 2027, subject to the receipt of required regulatory clearances and satisfaction of other customary closing conditions. Stockholders holding in aggregate approximately 63% of the voting power of Informatica Class A and Class B-1 common stock have delivered a written consent approving the transaction. No further action by other Informatica stockholders is required to approve the transaction. The transaction will be funded through a combination of cash on Salesforce’s balance sheet and new debt.\nSalesforce expects to achieve accretion on a non-GAAP operating margin, non-GAAP earnings per share, and free cash flow basis starting in the second year following the expected closing of the transaction and continuing thereafter, driven by substantial cost synergies and revenue uplift with a new comprehensive data portfolio. The transaction is not expected to disrupt Salesforce’s capital return program.\nSalesforce First Quarter Fiscal 2026 Results Conference Call\nSalesforce will release its first quarter fiscal 2026 results on Wednesday, May 28, 2025, after market close. A conference call will be held at 2:00 p.m. (PT) / 5:00 p.m. (ET) on Wednesday, May 28, 2025, to discuss the company’s financial results as well as the proposed transaction.\nAdvisors\nJ.P. Morgan Securities LLC is serving as financial advisor to Salesforce, and Wachtell, Lipton, Rosen & Katz and Morrison & Foerster LLP are serving as legal counsel to Salesforce.\nGoldman Sachs & Co. LLC is serving as exclusive financial advisor to Informatica, and Latham & Watkins LLP and Fenwick & West LLP are serving as legal counsel to Informatica.\nForward Looking Statements\nThese risks and uncertainties include, among other things, statements regarding the expected benefits to Salesforce, Informatica and their respective customers from completing the transaction, plans for future investment and capital allocation, the expected financial performance of Salesforce following the expected completion of the transaction, and the expected completion of the transaction. Statements regarding future events are based on the parties’ current expectations, estimates and projections and are necessarily subject to associated risks related to, among other things, (i) the completion of the proposed transaction on the anticipated terms and timing, or at all, including the parties’ ability to obtain regulatory approvals and satisfy other conditions to the completion of the transaction, (ii) the effect of the announcement or pendency of the proposed transaction on Informatica’s business, operating results, ability to retain and hire key personnel, and relationships with customers, suppliers, competitors and others, (iii) risks that the proposed transaction may disrupt Informatica’s current plans and business operations or divert management’s attention from ongoing business operations, (iv) the occurrence of any event, change or other circumstances that could give rise to the termination of the merger agreement, (v) the risk that the merger agreement may be terminated in circumstances requiring Salesforce or Informatica to pay a termination fee, (vi) the risk and outcome of any legal or regulatory proceedings related to the transaction, (vii) the potential effects on the accounting of the proposed transaction, (viii) legislative, regulatory and economic developments, (ix) general economic conditions, (x) restrictions during the pendency of the proposed transaction that may impact Informatica’s ability to pursue certain business opportunities or strategic transactions, (xi) the retention of key personnel, (xii) the ability of Salesforce to successfully integrate Informatica’s market opportunities, technology, personnel and operations and to achieve expected benefits, including the possibility that the expected benefits from the transaction will not be realized or will not be realized within the expected time period, (xiii) the possibility that competing offers may be made, (xiv) negative effects of the announcement or the consummation of the proposed acquisition on the market price of Salesforce’s common stock and/or operating results, (xv) the risk that Informatica’s stock price may decline if the proposed acquisition is not consummated, (xvi)  significant transaction costs and expenses, (xvii) risks related to the financing of the transaction, and (xviii) unknown liabilities.\nAdditional Information and Where to Find It\nThis press release is being made in respect of the proposed acquisition of Informatica by Salesforce. In connection with the proposed transaction, Informatica will file with the Securities and Exchange Commission (“SEC”) and furnish to Informatica’s stockholders an information statement on Schedule 14C and other relevant documents. Investors will be able to obtain free of charge the information statement and other documents filed by Informatica with the SEC at the SEC’s website at www.sec.gov or from Informatica’s website at investors.informatica.com.\nNon-GAAP Financial Measures\nThis press release includes information about non-GAAP operating margin, non-GAAP earnings per share (“EPS”) and free cash flow (collectively the “non-GAAP financial measures”). The primary purpose of using non-GAAP financial measures is to provide supplemental information that may prove useful to investors who wish to consider the impact of certain non-cash or non-recurring items on the company’s operating performance and to enable investors to evaluate the company’s results in the same way management does. Non-GAAP operating margin and non-GAAP EPS estimates exclude the impact of the following non-cash items: stock-based compensation, amortization of acquisition-related intangibles, charges related to the company’s restructuring activities and income tax adjustments. The company defines the non-GAAP measure free cash flow as GAAP net cash provided by operating activities, less capital expenditures. The method used to produce non-GAAP financial measures is not computed according to U.S. generally accepted accounting principles and may differ from the methods used by other companies. Non-GAAP financial measures are not meant to be considered in isolation or as a substitute for comparable GAAP measures and should be read only in conjunction with the company’s consolidated financial statements prepared in accordance with GAAP.\nAbout Informatica\nInformatica (NYSE: INFA), a leader in AI-powered enterprise cloud data management, helps businesses unlock the full value of their data and AI. As data grows in complexity and volume, Informatica’s Intelligent Data Management Cloud™ (IDMC) delivers a complete, end-to-end platform with a suite of industry-leading, integrated solutions to connect, manage and unify data across any cloud, hybrid or multi-cloud environment. Powered by CLAIRE® AI, Informatica’s platform integrates natively with all major cloud providers, data warehouses and analytics tools — giving organizations the freedom of choice, avoiding vendor lock-in and delivering better ROI by enabling them to access governed data, simplify operations and scale with confidence.\nTrusted by 5,000+ customers in nearly 100 countries — including over 80 of the Fortune 100 — Informatica is the backbone of platform-agnostic, cloud data-driven transformation.\nPermira and CPP Investments have provided unwavering support throughout the company’s transformative cloud and AI journey.\nInformatica. Where data and AI come to life.™\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nCompany News\nData\nMergers and Acquisitions\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Signs Definitive Agreement to Acquire Bluebirds\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Convergence.ai\n3 min read\nSalesforce Signs Definitive Agreement to Acquire Zoomin\n3 min read\nSalesforce Signs Definitive Agreement to Acquire Troops.ai\n1 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 2503, "token_count": 3468, "ingestion_ts": "2025-09-07T04:08:44.578441", "hash_sha256": "09e46725c9c50ae8f1ebf99bc49c1c6927e3c7d621cb27557fc3d6b16029f5dc", "html_title": "", "meta_published_time": "2025-05-27", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false}