{"doc_id": "crm::press::2024-06-20::sales-cloud::df3fdedd", "company": "Salesforce", "doctype": "press", "title": "Salesforce Automation Software by Sales Cloud", "publish_date": "", "url": "https://www.salesforce.com/sales/cloud/?bc=DB", "final_url": "https://www.salesforce.com/sales/cloud/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Sales Force Automation Software by Sales Cloud | Salesforce US\nSkip to content\nSales Cloud\nSet the foundation for revenue growth with sales force automation software. Close deals faster with guided selling and AI-powered deal insights. Predict future sales with visibility into pipeline and forecasts. Scale easily with automated sales processes and workflows — all built on the #1 trusted AI CRM for sales.\nWatch demo\nTry for free\nLeading sales teams grow with sales force automation software.\nEmpower your entire sales team with Sales Cloud.\nMaximize rep productivity, unlock valuable insights across the sales cycle, and automate processes and workflows on one platform to accelerate growth.\nBuild strong customer relationships and grow revenue with a single source of truth.\nActivity Management\nAutomatically capture emails, events, and other types of engagement activities directly in CRM. Manage activity data associated to the relevant leads, contacts, accounts, and opportunities in one spot, creating a single source of truth. Get visibility into selling activities at scale with out-of-the-box reporting to make it easy to focus on what matters most.\nLead Management\nConnect with customers and track deals across every channel. Use AI to prioritize the best leads based on the customer profiles that drive the most revenue. Increase rep efficiency with actionable, prioritized to-do lists right in Salesforce.\nAccount and Opportunity Management\nMove deals forward faster with specific guidance for sellers throughout the sales process. Get deal-specific insights, build account plans, and easily unify opportunity and account data for a single customer profile — whether you're working directly in your CRM, or on the go.\nGet visibility to stay on track and exceed targets.\nForecast Management\nBuild accurate forecasts in real time to drive predictable growth. Tailor metrics to align with business goals. Drive accountability and keep everyone on track with a shared understanding of top deals and forecast trends.\nPipeline Management\nMaintain and manage pipeline in a single, consolidated view. Track changes over time with built-in charts. Focus on the most important deals with the help of AI and use deal insights to provide proactive coaching.\nReports and Dashboards\nUse data to drive action with a suite of out-of-the-box reporting tools. Easily visualize metrics with dashboards and quickly drill into the key drivers of sales performance. Track lead volume, activity conversion rates, and sales pipeline with ease. Personalize reports and dashboards so every member of the sales team has the information they need to sell faster.\nDrive productivity with automated sales processes.\nWorkflow and Process Automation\nDrive seller efficiency by automating complex sales processes and workflows with drag and drop simplicity. Manage and maintain territory assignments to optimize account coverage and align with sales goals.\nQuoting and Contract Approvals\nClose deals faster with standard and templated quotes synced to sales opportunities. Speed up the contract approval process with automated workflows directly within Salesforce.\nCRM Everywhere and Collaboration\nAccess and update CRM from anywhere with the browser extension and mobile app. Collaborate across teams to quickly swarm on sales opportunities. Create mutual account plans and share knowledge, files, and data to keep teams and customer informed at every stage.\nExtend the power of sales force automation with these related products.\nSales Engagement\nAccelerate sales with engagement built directly into your CRM.\nLearn more\nSales AI\nGuide sellers at every step of the sales cycle with Einstein-informed intelligence built into your CRM.\nLearn more\nSales Analytics\nDrive forecast accuracy, grow pipeline, and optimize revenue with Sales Cloud and Tableau insights.\nLearn more\nSales Performance Management\nUnlock peak performance with automation and actionable insights at every step — from sales planning to execution.\nLearn more\nView all products\nSales Cloud Pricing\nFind the right Sales Cloud edition for your business needs.\nCurrency converter\nUS Dollar (USD)\nAustralian Dollar (AUD)\nBritish Pound (GBP)\nEuro (EUR)\nJapanese Yen (JPY)\nSwedish Krona (SEK)\nStarter Suite\nThe simple CRM suite with marketing, sales, and service.\n$\n25\nUSD/User/Month\n(Billed monthly or annually)\n$\n25\nUSD/User/Month\n(Billed monthly or annually)\n25\n€\nEUR/User/Month\n(Billed monthly or annually)\nAU$\n35\nAUD/User/Month\n(Billed monthly or annually)\n3,000\n円\nJPY/User/Month\n(Billed monthly or annually)\n250\nkr\nSEK/User/Month\n(Billed monthly or annually)\n£\n20\nGBP/User/Month\n(Billed monthly or annually)\nSimplified Setup and Onboarding\nLead, Account, Contact, and Opportunity Management\nEmail Integration\nTry for free\nPro Suite\nThe enhanced CRM suite with even more marketing, sales, service, and commerce tools.\n$\n100\nUSD/User/Month\n(Billed annually)\n$\n100\nUSD/User/Month\n(Billed annually)\n100\n€\nEUR/User/Month\n(Billed annually)\nAU$\n140\nAUD/User/Month\n(Billed annually)\n12,000\n円\nJPY/User/Month\n(Billed annually)\n1,000\nkr\nSEK/User/Month\n(Billed annually)\n£\n80\nGBP/User/Month\n(Billed annually)\nForecast Management\nCustomizable Reports and Dashboards\nQuoting and Contracting\nTry for free\nEnterprise\nThe CRM for sales with more flexibility and web API.\n$\n175\nUSD/User/Month\n(Billed annually)\n$\n175\nUSD/User/Month\n(Billed annually)\n175\n€\nEUR/User/Month\n(Billed annually)\nAU$\n245\nAUD/User/Month\n(Billed annually)\n21,000\n円\nJPY/User/Month\n(Billed annually)\n1,750\nkr\nSEK/User/Month\n(Billed annually)\n£\n140\nGBP/User/Month\n(Billed annually)\nEverything in Pro Suite plus Advanced Pipeline Management & Deal Insights\nConversation Intelligence\nAgentforce\nTry for free\nUnlimited\nThe CRM for sales with intelligent automation and developer support built in.\n$\n350\nUSD/User/Month\n(Billed annually)\n$\n350\nUSD/User/Month\n(Billed annually)\n350\n€\nEUR/User/Month\n(Billed annually)\nAU$\n490\nAUD/User/Month\n(Billed annually)\n42,000\n円\nJPY/User/Month\n(Billed annually)\n3,500\nkr\nSEK/User/Month\n(Billed annually)\n£\n280\nGBP/User/Month\n(Billed annually)\nEverything in Enterprise plus Predictive AI\nConversation Intelligence and Sales Engagement\nPremier Success Plan and Full Sandbox\nTry for free\nAgentforce 1 Sales\nThe complete Sales CRM with built-in AI and unified data. One platform that does it all.\n$\n550\nUSD/User/Month\n(Billed annually)\n$\n550\nUSD/User/Month\n(Billed annually)\n550\n€\nEUR/User/Month\n(Billed annually)\nAU$\n770\nAUD/User/Month\n(Billed annually)\n66,000\n円\nJPY/User/Month\n(Billed annually)\n5,500\nkr\nSEK/User/Month\n(Billed annually)\n£\n440\nGBP/User/Month\n(Billed annually)\nEverything in Unlimited, plus our full suite of AI\nUnmetered Agentforce usage for employees\nSalesforce Spiff, Sales Planning, Sales Programs, Salesforce Maps, Tableau Next, and Slack Enterprise+\n1M Flex Credits & 2.5M Data Cloud Credits per org per year\nThis page is provided for information purposes only and subject to change. Contact a sales representative for detailed pricing information.\nView detailed pricing\nCombining Sales Cloud and Slack gives my entire workforce the ability to work together in real time.\nJennifer Kady\nVP, Global Markets Sales, IBM\nRead the story\nGet the most out of sales force automation software with partner apps and experts.\nAccelerate revenue growth with thousands of prebuilt and consultant offerings on AppExchange. Check them out today.\nAchieve your AI and data goals with Salesforce CTOs.\nTrusted advisors with unmatched Salesforce experience and expertise, by your side.\nLearn more\nJoin the Salesblazer Community.\nLooking to meet and learn from fellow sales professionals? Our Salesblazer Community is the place for you.\nBecome a Salesblazer with free, guided learning on Trailhead.\nHit the ground running with sales force automation tips, tricks, and best practices.\nReport\n2025 Gartner® Magic Quadrant™ for Sales Force Automation Platforms.\nGet the report\nGuided Tour\nTake the Sales Cloud guided tour.\nTake the tour\nBlog\n10 New Findings Reveal How Sales Teams Are Achieving Success Now\nLearn more\nReport\nDiscover the latest insights from 5,500 sales professionals.\nGet the report\nSee all resources\nReady to take the next step with the world’s #1 AI CRM for Sales?\nStart your trial.\nTry Sales Cloud free for 30 days. No credit card, no installations.\nTry for free\nTalk to an expert.\nTell us a bit more so the right person can reach out faster.\nRequest a call\nStay up to date.\nSales Force Automation FAQs\nWhat is Sales Cloud?\nSales Cloud’s sales force automation software helps companies sell smarter, faster, and more efficiently by providing everything your sales teams need on one integrated platform.\nWhat are the benefits of Sales Cloud?\nSales Cloud offers the complete sales tech suite where AI and automation are built-in and is designed to easily scale as you grow. Built on the #1 trusted CRM platform, organizations can deliver end-to-end revenue management across the entire customer lifecycle and centralize all customer data together for a complete customer profile on a single platform.\nHow do I get started implementing Sales Cloud?\nWhat is sales force automation?\nSales force automation\nis a system that streamlines and enhances\nsales processes\n, including\nlead management\n, customer tracking, and\nsales forecasting\n, to boost efficiency and performance.\nWhat are the benefits of sales force automation by Sales Cloud?\nSales Cloud offers a complete sales tech suite where AI and automation are built in and designed to scale easily as you grow. The benefits of sales force automation include:\nImproved productivity:\nAutomate routine tasks so sales teams can focus on closing deals.\nBetter lead management:\nCapture, track, and prioritize leads for higher conversion rates.\nEnhanced customer tracking:\nProvide detailed customer profiles for personalized service.\nMore accurate sales forecasting:\nAnalyze data for better predictions and decision-making.\nIncreased efficiency:\nCentralize data and automate workflows for faster deal closures.\nImproved collaboration:\nEnable faster communication among team members.\nData-driven insights:\nMake more strategic decisions using real-time data and analytics.\nScalability:\nHandle growing data and complex processes as your business expands.\nThese benefits help sales teams perform better and drive business growth.\nHow does sales force automation work?\nSales force automation works by updating data based on set activity triggers within a CRM. AI can be used to speed this up, identifying and updating data based on triggers that aren't set manually and generating appropriate content for output like emails and proposals. By using predictive AI with sales force automation, your system can analyze any data you give it access to and help surface the most likely leads and best actions to take.", "word_count": 1607, "token_count": 2251, "ingestion_ts": "2025-09-07T04:13:50.950699", "hash_sha256": "10274afbea8c503a963f860a14848103a84cfaccc2ba8e6915be876fb718026e", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "missing", "publish_date_confidence": 0.0, "was_fallback_today": false}