{"doc_id": "crm::press::2025-02-10::salesforce-announces-500m-investment-in-saudi-arabia-to-driv::cc9d80ee", "company": "Salesforce", "doctype": "press", "title": "Salesforce Announces $500M Investment in Saudi Arabia to Drive AI Innovation and Growth", "publish_date": "2025-02-10", "url": "https://www.salesforce.com/news/press-releases/2025/02/10/saudi-arabia-investment/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/02/10/saudi-arabia-investment/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Partnership|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Salesforce Invests $500M in Saudi Arabia - Salesforce\nSkip to Content\nSkip to Footer\n0%\nArtificial Intelligence\nSalesforce Announces $500M Investment in Saudi Arabia to Drive AI Innovation and Growth\nFebruary 10, 2025\n3 min read\nMedia Library\nInvestment will support enterprises as they build limitless digital workforces with Agentforce and Hyperforce in Saudi Arabia\nSalesforce teams up with Capgemini, Deloitte, Globant, IBM, PwC, and more to accelerate digital growth in the region\nSalesforce reaffirms commitment to Arabic language support to foster inclusive AI\nRIYADH, SAUDI ARABIA – February 10, 2025 –\nSalesforce today announced plans to invest $500 million in the Kingdom of Saudi Arabia, building on its commitment to innovation and economic growth in the region. The investment also aims to spur workforce development through\nAI\nskilling and expand Salesforce’s local partner ecosystem to support local businesses.\nThe announcement, made today at LEAP 2025, follows the company’s Davos pledge to expand its presence in Saudi Arabia with\nnew regional headquarters in Riyadh\n. The increasing adoption of\nAgentforce\n, Salesforce’s digital labor platform, by businesses in the region underscores the growing demand for AI-driven solutions and reinforces Salesforce’s commitment to this technology in the Kingdom.\nAs part of this expansion, Salesforce will bring\nHyperforce\n, its next-generation platform architecture, to Saudi Arabia. Delivered through a strategic partnership with\nAmazon Web Services (AWS)\n, Hyperforce in the Kingdom of Saudi Arabia enables Salesforce’s global customer base to run workloads locally through a distributed public cloud infrastructure. This expansion also allows local businesses and talent to leverage Salesforce and its most innovative products while ensuring trust by remaining compliant with local regulations.\n“Salesforce’s investment in the Kingdom is a continuation of our shared commitment to drive AI growth,”\nsaid His Excellency Eng. Abdullah Alswaha, Minister of Communications and Information Technology\n. “We look forward to seeing Salesforce expand its presence here and welcome the investment in AI that will drive unprecedented innovation and operational efficiency, supporting the realization of Saudi Arabia’s Vision 2030 goals.”\n“We are entering a new era where autonomous AI agents working with humans are transforming workforces and businesses across the globe,”\nsaid Marc Benioff, Chair and CEO, Salesforce.\n“With Agentforce, Hyperforce, and our global partner ecosystem, we are empowering Saudi organizations to deliver unprecedented levels of productivity, growth, and customer success.”\nAdvancing AI skills and innovation through regional partnerships\nAgentforce, a complete AI solution for augmenting teams with\nautonomous AI agents\nin the flow of work, is helping businesses around the world scale their operations with\nagentic AI\n. Ecosystem partnerships with\nCapgemini\n,\nDeloitte\n,\nGlobant, IBM\n, and\nPwC\nmay further extend the capabilities of this technology in Saudi Arabia by providing tailored solutions and specialized expertise, empowering enterprises to unlock new capacity for growth.\nAdditionally, Salesforce\nremains committed\nto upskilling 30,000 Saudi citizens in AI, with a strong focus on increasing women’s workforce participation to foster inclusivity. As part of this pledge, the company is planning to partner with Riyadh-based\nPrincess Nourah University (PNU)\n, the largest women’s university in the world, to bring AI-focused learning and workforce development opportunities to female students. By leveraging\nTrailhead\n, the partnership aims to equip the next generation of women leaders in K.S.A. with the skills needed to excel in the digital economy, supporting the Kingdom’s Vision 2030 for inclusive growth.\n“We are thrilled with our cooperation with Salesforce. This investment not only underscores their confidence in our vision and capabilities but also paves the way for groundbreaking advancements in education,”\nsaid Dr. Ala Alluhaidan, Dean of Development and Quality Deanship at Princess Nourah Bint Abdulrahman University.\n“Together, we are committed to fostering innovation, empowering our students, and making a lasting impact on society.”\nCommitment to Arabic language support\nSalesforce is also continuing its commitment and expansion to AI-driven transformation and workforce development across the Kingdom, with an expanded focus on advancing Arabic language support.\nMore information:\nLearn more about\nAgentforce\n, the digital labor platform\nRead how Salesforce\ndeployed Agentforce on help.salesforce.com\nShare article\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nPublic Policy\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 869, "token_count": 1288, "ingestion_ts": "2025-09-07T02:42:32.778706", "hash_sha256": "4cb73a936bb08d5bbe7821ff9677669c542351182f455bda270e16efb01ff84d", "html_title": "", "meta_published_time": "2025-02-10", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false, "link_ok": true, "link_status": 200}