{"doc_id": "crm::press::2025-06-03::salesforce-and-liv-golf-announce-strategic-partnership-to-po::f7f8420e", "company": "Salesforce", "doctype": "press", "title": "Salesforce and LIV Golf Announce Strategic Partnership to Power New Era of Fan and Player Experiences with Agentforce", "publish_date": "2025-06-03", "url": "https://www.salesforce.com/news/press-releases/2025/06/03/liv-golf-agentforce-experiences/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/06/03/liv-golf-agentforce-experiences/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Salesforce and LIV Golf Announce Strategic Partnership to Power New Era of Fan and Player Experiences with Agentforce - Salesforce\nSkip to Content\nSkip to Footer\n0%\nAgents\nSalesforce and LIV Golf Announce Strategic Partnership to Power New Era of Fan and Player Experiences with Agentforce\nJune 3, 2025\n4 min read\nMedia Library\nSalesforce’s Agentforce to Transform LIV Golf Fan Engagement, Player Experience, Broadcast Innovation, and Business Operations\nSan Francisco & London  – June 3, 2025 –\nSalesforce, the #1 AI CRM, and LIV Golf, today announced a strategic partnership that brings Agentforce, Salesforce’s digital labor platform, to the groundbreaking global golf league. This collaboration will help LIV Golf scale its global business infrastructure and operations with intelligent, autonomous AI agents to amplify fan engagement, player experience, and broadcast innovation.\nFueling a New Standard in Sport with Agentforce\nLeveraging the full power of Salesforce, which brings together apps, data, agents and metadata in a single, deeply unified platform—LIV Golf will embed secure, trusted AI technology to:\nSupercharge Fan Engagement | Introducing The Fan Caddie powered by Agentforce\nWith a shared vision to push the boundaries of sport and technology while serving LIV Golf’s vibrant/growing global fanbase, Salesforce and Agentforce will deliver dynamic, real-time LIV Golf updates tailored to each fan’s journey–curating content, highlights, and tournament experiences based on location, preferences, and behaviors. For example, the Fan Caddie will provide golf enthusiasts an immersive second screen experience within the LIV mobile app where they will receive shot-by-shot breakdowns, real-time updates on player stats and standings, support with ticket and merchandise requests, and recommended content that best aligns with the fan’s personal preferences.\nEnhancing Golf Broadcasts and Digital Content in Real Time | The Agent Caddie powered by Salesforce\nAgent Caddie will deliver predictive shot outcomes, optimal golf strategies, contextual stats, and narrative cues directly in LIV Golf broadcasts – enabling richer, more data-driven live coverage.\nOptimize Tournament Operations and Sponsorship\nFrom equipment logistics to staff coordination, Agentforce will optimize the operational engine behind LIV Golf events, helping to make every tournament smarter, faster, and more responsive. With limitless digital labor, LIV Golf and its partners will unlock new commercial opportunities through advanced audience segmentation, smarter sponsorship alignment, and real-time impact reporting.\nElevate Global Expansion Efforts\nWith events spanning the globe, Agentforce will help LIV Golf scale smarter by coordinating international operations, localizing fan engagement, and surfacing insights to drive global growth.\nEmpower Player Experience On and Off the Course\nLIV Golf and Salesforce are also exploring how Agentforce can support players directly, such as assisting with personalized wellness tracking, and providing real-time performance insights and recommendations.\n“LIV Golf is reimagining what the future of sport can be, and with Agentforce, we’re helping bring that vision to life,” said Ariel Kelman, Chief Marketing Officer, Salesforce. “The Fan Caddie, an immersive second screen experience, will offer fans deeply personalized content, experiences, and recommendations. The Agent Caddie agent will enhance the broadcast, providing rich, predictive insights directly to fans and commentators.”\n“At LIV Golf, innovation drives everything we do — from the fan experience to the way we support our players and grow the game,” said Denise Taylor, Head of Product and Technology, LIV Golf. “Our partnership with Salesforce marks a major step forward. With Agentforce, we’re bringing the power of AI technology to the forefront of sport, creating a more connected and engaged future for our fans, players, and the fantastic game of golf.”\n“We are excited about a long, impactful future ahead for LIV Golf, buoyed by our ability to welcome and engage a broader, more diverse global audience,” said Bryson DeChambeau, Crushers GC Captain. “We are proud to welcome Salesforce into our growing family of partners, who will help us reimagine and amplify the golf experience through our shared goals of making the game more connected, inclusive and innovative.”\nLearn\nmore about the LIV Golf and Salesforce partnership.\nAbout LIV Golf\nThe LIV Golf League is the world’s only global golf League featuring 13 teams, a 14-tournament schedule, and many of the world’s best golfers. Launched in 2022, the League was designed to expand the sport on a global level and create new value within the golfing ecosystem while enhancing the game’s societal impact. A landmark investment by LIV Golf also launched The International Series, a set of 10 enhanced events sanctioned by the Asian Tour, with elevated prize funds in world-class destinations, offering a pathway for leading professional and amateur golfers from around the world into the LIV Golf League. Only three years into operations and with tournaments across North and Latin Americas, Asia, Australia, the Middle East and Europe, LIV Golf remains committed to developing the sport at every level and exposing more people to the positive virtues of the game through its unique blend of intense competition and entertainment.\nLIV Golf is owned and operated by LIV Golf Investments whose vision and mission are centered around making holistic and sustainable investments to enhance the global golf ecosystem and unlock the sport’s untapped worldwide potential.\nShare article\nJust For You\nWhy Agentic AI Requires a Smarter Cloud Infrastructure\n4 min read\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nWhy Agentic AI Requires a Smarter Cloud Infrastructure\n4 min read\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nAutomation\nDigital Transformation\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nSalesforce Life Sciences Cloud Now Selected by More than 70 Industry-Leading Customers to Scale Engagement and Improve Patient Outcomes\n8 min read\nHow Agentic AI Can Help Overcome the Child Welfare Information Crisis\n8 min read\nManufacturers Gain New AI Workforce: Salesforce’s Agentforce for Manufacturing Optimizes Production, Boosts Sales, and Cuts Downtime\n7 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1164, "token_count": 1658, "ingestion_ts": "2025-09-07T02:42:29.129734", "hash_sha256": "5e988db4ff7e4679380b4a7f6c744c0770079c390ddbc2b6bfcdcd8933917c74", "html_title": "", "meta_published_time": "2025-06-03", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false, "link_ok": true, "link_status": 200}