{"doc_id": "crm::press::2025-07-09::salesforce-appoints-amy-chang-and-david-b-kirk-to-its-board-::c224c273", "company": "Salesforce", "doctype": "press", "title": "Salesforce Appoints Amy Chang and David B. Kirk to its Board of Directors", "publish_date": "2025-07-09", "url": "https://www.salesforce.com/news/press-releases/2025/07/09/salesforce-appoints-amy-chang-and-david-b-kirk-to-its-board-of-directors/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/07/09/salesforce-appoints-amy-chang-and-david-b-kirk-to-its-board-of-directors/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Partnership|Product", "persona_tags": ["cio", "vp_customer_experience"], "language": "en", "text": "Salesforce Appoints Amy Chang and David B. Kirk to its Board of Directors - Salesforce\nSkip to Content\nSkip to Footer\n0%\nCompany News\nSalesforce Appoints Amy Chang and David B. Kirk to its Board of Directors\nJuly 9, 2025\n4 min read\nMedia Library\nNew directors deepen the Board’s innovation leadership and technical expertise for the agentic AI era\nSAN FRANCISCO — July 9, 2025 —\nSalesforce (NYSE: CRM), the world’s #1 AI CRM, today announced the appointments of Amy Chang, accomplished technology executive, AI entrepreneur, and advisor, and David Kirk, pioneering computer scientist and former NVIDIA chief scientist, to the Salesforce Board of Directors, effective immediately.\n“I’m thrilled to welcome Amy and David to Salesforce’s Board. Their exceptional experience driving innovation and deep technical expertise will be invaluable as we unlock the full potential of human-AI collaboration and digital labor for our customers with Agentforce and across our deeply unified platform,” said Marc Benioff, Chair and CEO of Salesforce. “With Amy and David, we continue to build the most innovation-forward and technical board in Salesforce’s history – strengthening our ability to deliver transformative value for all our stakeholders in this new agentic AI era. I couldn’t be more excited about the opportunity ahead.”\n“At Salesforce, we take a deliberate and thoughtful approach to board composition to ensure we have the right expertise to lead and navigate times of profound transformation and change,” said Arnold Donald, Lead Independent Director, Salesforce Board of Directors. “Amy and David bring tremendous technical depth and innovation expertise at a pivotal moment when AI and Salesforce are redefining the future of business. I’m confident their perspectives will help support the Board in guiding Salesforce’s strategy and governance in this agentic era – fueling shareholder value creation and positive societal impact through innovation, operational discipline, and sustainable, profitable growth.”\nAbout Amy Chang\nAmy Chang serves on the Board of Directors for The Walt Disney Company and Procter & Gamble, where she also chairs the Innovation and Technology Committee. She has also served on the boards of Cisco, Informatica, Marqeta, and Splunk.\nPreviously, Ms. Chang served as EVP and GM of Cisco’s multi-billion dollar Collaboration business – including videoconferencing, cloud calling, contact center, video devices, and phones – after the acquisition of her startup Accompany, an AI/ML-based relationship intelligence platform serving Fortune 500 companies.\nPrior to Accompany, Ms. Chang spent more than seven years at Google, where she led the teams for Google Analytics, Website Optimizer, Trends, and multichannel attribution, growing Google Analytics to serve over 86% of the entire web. She previously led product strategy for the paid search and affiliates channels at eBay, and worked in the semiconductor and software industries at McKinsey. She started her career in hardware with AMD, Intel, and Motorola.\nMs. Chang serves on the UCSF Hospital Executive Committee, Stanford School of Engineering Dean’s Advisory Board as Chair, and as an advisor to a number of AI applications and infrastructure startups and Google’s Moonshot Factory (X).\nShe holds a B.S. in Electrical Engineering with a hardware subspecialty and an M.S. in Electrical Engineering with a network systems subspecialty, both from Stanford University.\nAbout David B. Kirk\nDavid B. Kirk is an independent consultant, investor, philanthropist, and advisor, and serves on several nonprofit boards. More recently, he has focused on computer science education, advancing parallel programming, robotics, and artificial intelligence.\nPreviously, Dr. Kirk served as Chief Scientist and VP of Architecture, and later as a Fellow, at NVIDIA. He has long been known for his contributions to parallel computing, graphics hardware, and graphics algorithm research, and is the inventor or co-inventor of nearly 100 patents in computer graphics and parallel computing hardware and software.\nDr. Kirk received the 2002 Computer Graphics Achievement Award from the Association for Computing Machinery Special Interest Group on Graphics and Interactive Technology (ACM SIGGRAPH), was elected to the National Academy of Engineering in 2006, and was recognized with Caltech’s Distinguished Alumni Award in 2009.\nHe earned his Ph.D. in Computer Science with a minor in Computation and Neural Systems and his M.S. in Computer Science from Caltech, as well as B.S. and M.S. degrees in Mechanical Engineering from the Massachusetts Institute of Technology.\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nExplore related content by topic\nCompany News\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Increases Investment in Genesys to Advance AI-Driven Customer Experience\n1 min read\nSalesforce Signs Definitive Agreement to Acquire Bluebirds\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Informatica\n11 min read\nSalesforce Signs Definitive Agreement to Acquire Convergence.ai\n3 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 955, "token_count": 1387, "ingestion_ts": "2025-09-07T02:42:29.869292", "hash_sha256": "9765bab96f4906072172321f7bc7393e3d8a5ae61671a87703a49b329983360a", "html_title": "", "meta_published_time": "2025-07-09", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false, "link_ok": true, "link_status": 200}