{"doc_id": "crm::press::2025-02-05::salesforce-appoints-robin-washington-as-president-and-chief-::7290f155", "company": "Salesforce", "doctype": "press", "title": "Salesforce Appoints Robin Washington as President and Chief Operating and Financial Officer", "publish_date": "2025-02-05", "url": "https://www.salesforce.com/news/press-releases/2025/02/05/salesforce-appoints-robin-washington-as-president-and-chief-operating-and-financial-officer/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/02/05/salesforce-appoints-robin-washington-as-president-and-chief-operating-and-financial-officer/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Partnership|Product", "persona_tags": ["cio"], "language": "en", "text": "Salesforce Appoints Robin Washington as President and Chief Operating and Financial Officer - Salesforce\nSkip to Content\nSkip to Footer\n0%\nCompany News\nSalesforce Appoints Robin Washington as President and Chief Operating and Financial Officer\nFebruary 5, 2025\n3 min read\nMedia Library\nBrian Millham, President and COO, to Retire After 25 Years at Salesforce\nFeb 5, 2025 — SAN FRANCISCO —\nSalesforce (NYSE: CRM), the world’s #1 AI CRM, today announced that Robin Washington will become President and Chief Operating and Financial Officer (COFO), effective March 21, 2025. In this newly created role, Washington will lead Salesforce’s next phase of transformation—driving profitable growth, operational excellence, and financial strategy—while accelerating the transformation of every company into an Agentforce company, in the new agentic era.\nA seasoned executive and visionary leader, Washington has spent decades at the forefront of financial and operational strategy at some of the world’s most respected companies, including Gilead Sciences, Hyperion, and PeopleSoft. She has also been an active member of the Salesforce Board since 2013, previously serving as Chair of the Audit and Finance Committee and as Lead Independent Director since 2022. In addition, Washington has served on the boards of Alphabet, Eikon Therapeutics, Honeywell International and Vertiv Holdings.\nSalesforce also announced that after an extraordinary 25-year career at Salesforce, Brian Millham will retire on May 1, 2025, transitioning into an advisory role.\n“I am thrilled to welcome Robin as COFO at this incredible moment when Al agents are redefining the workforce,” said Marc Benioff, Chair and CEO of Salesforce. “Robin has been a trusted partner, advisor, and a key architect of our strategy as we accelerate the rise of Agentforce — the first digital labor platform. Her operational mastery, financial expertise, and strategic vision make her the perfect leader to guide Salesforce through this transformational shift. As we look ahead, I’m excited to work with Robin, in this newly created role, and with our incredible Salesforce executive bench, to bring this significant Agentforce opportunity to life.”\nI am thrilled to welcome Robin as COFO at this incredible moment when Al agents are redefining the workforce.\nMarc Benioff, Chair and CEO of Salesforce\n“I also want to thank Brian Millham for a quarter of a century of dedication, leadership, and unwavering commitment to our success,” Benioff added. “From pioneering Salesforce’s legendary sales organization to building a world-class Customer Success operation, to driving our operational and financial transformation as COO, Brian has shaped the very DNA of Salesforce. His impact will be felt for decades to come.”\n“I am deeply honored to step into this role at such a defining moment for Salesforce and the entire industry,” said Robin Washington. “Having worked closely with Marc and the executive team for over a decade, I couldn’t be more excited to help lead Salesforce and our global community of employees, customers, and Trailblazers into this agent-first era that will fundamentally change how businesses operate, innovate, and grow.”\nAfter Washington joins the company on March 21, 2025, Arnold Donald will become the Company’s Lead Independent Director. Washington will remain on the Salesforce Board of Directors.\nAmy Weaver, the current CFO, announced last year that she would be transitioning from Salesforce once a new CFO was named.\nAbout Robin Washington\nRobin Washington has served as a Salesforce Board Director since 2013, and Lead Independent Director since 2022, playing a critical role in Salesforce’s financial and strategic evolution. She previously served as EVP & CFO of Gilead Sciences (2008–2019), CFO of Hyperion Solutions (2006–2007), and Chief Accounting Officer of PeopleSoft.\nWashington currently serves on the Board of Directors of Alphabet Inc., Eikon Therapeutics, Honeywell International, and Vertiv Holdings Co. She holds a B.A. in Business Administration from the University of Michigan and an M.B.A. from Pepperdine University.\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nShare article\nJust For You\nSalesforce Signs Definitive Agreement to Acquire Regrello\n2 min read\nSalesforce Signs Definitive Agreement to Acquire Waii\n3 min read\nExplore related content by topic\nCompany News\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Increases Investment in Genesys to Advance AI-Driven Customer Experience\n1 min read\nSalesforce Signs Definitive Agreement to Acquire Bluebirds\n2 min read\nSalesforce Appoints Amy Chang and David B. Kirk to its Board of Directors\n4 min read\nSalesforce Signs Definitive Agreement to Acquire Informatica\n11 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nSkip to Content\nSkip to Header\nCopied", "word_count": 867, "token_count": 1285, "ingestion_ts": "2025-09-07T04:13:54.024153", "hash_sha256": "3f44667b863f45d519616f8f903d80d4992d10e1ae058be0f2a4cc573b223373", "html_title": "", "meta_published_time": "2025-02-05", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false}