{"doc_id": "crm::press::2025-01-06::holiday-shoppers-spend-a-record-1-2t-online-salesforce-data-::796a8bdf", "company": "Salesforce", "doctype": "press", "title": "Holiday Shoppers Spend a Record $1.2T Online, Salesforce Data Shows", "publish_date": "2025-01-06", "url": "https://www.salesforce.com/news/press-releases/2025/01/06/2024-holiday-shopping-data/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/01/06/2024-holiday-shopping-data/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Product", "persona_tags": ["cio"], "language": "en", "text": "Salesforce Shares 2024 Holiday Shopping Data - Salesforce\nSkip to Content\nSkip to Footer\n0%\nAgents\nHoliday Shoppers Spend a Record $1.2T Online, Salesforce Data Shows\nJanuary 6, 2025\n5 min read\nMedia Library\nRetailers tap AI and agents to increase margins and enhance the holiday shopping experience\nSAN FRANCISCO — Jan. 6, 2025 — Salesforce (NYSE: CRM), the world’s #1 AI CRM, today revealed\nnew data\nshowing holiday retail sales surged to a record $1.2 trillion globally and $282 billion in the United States, but high returns could dampen overall profit margins.\nThe report indicates that the\nbetter-than-expected\nholiday shopping season was powered by surges in\nmobile\nand\nsocial commerce\nalongside increased consumer spending after\nmonths of saving\nin the first half of 2024. However, shoppers have already sent back $122 billion in merchandise. Both consumers and retailers leaned into the use of\nAI\nand\nagents\nto enhance holiday shopping experiences through product recommendations and personalized order support, influencing $229 billion – or 19% – of all online orders.\n“Retailers had a robust holiday season, but a 28% rise in the rate of returns compared to last year is a cause for some concern,” said Caila Schwartz, Director of Consumer Insights at Salesforce. “Retailers who have embraced AI and agents are already seeing the benefits, but these tools will be even more critical in the new year as retailers aim to minimize revenue losses on returns and reengage with shoppers.”\nTop Salesforce 2024 holiday shopping insights\n(Nov. 1 – Dec. 31, 2024)\nSalesforce data, based on an analysis of 1.5 billion shoppers and 1.6 trillion page views across the\nSalesforce Platform\n, highlights trends that shaped the holiday season, including:\nOnline sales and order growth reached new peaks:\nOnline sales reached $1.2 trillion globally and $282 billion in the U.S.\nThis represents a 3% global year-over-year (YoY) increase and a 4% YoY increase in the U.S.\nOnline sales also grew 1% YoY in the European Union (EU).\nRetailers harness the value of AI and agents:\n$229 billion of global online sales were influenced by AI and agents in the form of product recommendations, targeted offers, and conversational customer service support.\n19% of holiday purchases were influenced by consumers engaging with AI and agents, a 6% increase from 2023.\nRetail use of\ngenerative AI\nfeatures like agents increased 25% during the holiday season compared to September and October in 2024.\nShoppers used AI- and agent-powered chat for customer service 42% more than they did during the 2023 holiday season.\n$229 billion of global online sales were influenced by AI and agents in the form of product recommendations, targeted offers, and conversational customer service support.\nThe rate of returns rapidly increases:\nMore than $122 billion of global purchases have already been returned, up 28% from last year.\nThis increase is partially due to trending consumer behaviors like\n“try-on hauls” and bracketing\n(buying an extra size above and below your standard size).\nSalesforce projects that retailers will likely see this number grow to $133 billion – presenting an important opportunity for brands to use agents to make the returns process easier and more tailored to specific customer needs.\nNew Salesforce survey data suggests that 75% of U.S. shoppers are interested — and one-third are\nvery\ninterested\n—\nin using an AI agent to complete returns and exchanges.\nNew Salesforce survey data suggests that 75% of U.S. shoppers are interested — and one-third are\nvery\ninterested\n—\nin using an AI agent to complete returns and exchanges.\nSocial commerce grows its influence on shoppers:\nRetailers using social commerce strategies saw 20% of global holiday sales generated through platforms like TikTok Shop and Instagram.​​\nSocial media as a traffic-referring channel also grew 8% YoY, driving 14% of all traffic to ecommerce sites during the season.\nMobile conversion picks up the pace:\nWhile global mobile traffic share remained the same YoY (79%), the percentage of orders placed grew to nearly 70%, up from 67% in 2023.\nMobile orders reached their highest level on Christmas Day, accounting for 79% of all orders, up from 77% in 2023.\nSurvey data from Salesforce also found that 79% of U.S. shoppers say a store associate used a mobile device to help them shop in store in the last year.\nOverall, $842 billion in global sales and $195 billion in U.S. sales were initiated by mobile devices.\nRetailers offer modest discounts:\nAverage discount rates for the entirety of the 2024 holiday season reached 23% in the U.S. (up 1% YoY) and 22% globally (up 2% YoY).\nThe verticals with the highest global discount rates were:\nMakeup (36%)\nGeneral apparel (30%)\nSkincare (28%)\nThe verticals with the highest U.S. discount rates were:\nGeneral apparel (33%)\nHealth and beauty (29%)\nHome goods and decor (18%)\nWhile discounts might have been lackluster for consumers this holiday season, loyalty programs are proving to be promising for customer retention. Nearly three-quarters (72%) of U.S. shoppers surveyed by Salesforce say loyalty programs make them more likely to continue doing business with brands.\nSalesforce powered the 2024 holiday season\nBrands and retailers around the world found success with Salesforce this holiday season:\nCommerce Cloud\npowered more than 220 million online orders while delivering fast, easy, and personalized digital experiences to shoppers.\nMarketing Cloud\nfacilitated more than 378 billion marketing messages for businesses this holiday season, a 5% YoY increase.\nService Cloud\nhelped customers field and resolve nearly 33.3 billion case interactions throughout the holidays.\nData Cloud\ningested over 8.5 trillion records (+77% YoY), processed nearly 1.4 quadrillion records (+29% YoY), and helped retailers action over 840 billion profiles across various platforms and channels like Marketing Cloud, Yahoo, and Google.\nEinstein\nprovided more than 368 billion AI-powered product recommendations to shoppers this holiday season to personalize the customer experience, up 30% from last year.\nExplore further:\nCompare this data to Salesforce’s\n2024 holiday season forecast\nVisit the\nHoliday Shopping\nHQ\nfor real-time holiday shopping results\nCheck out\nhow Saks elevates luxury shopping\nwith unified data and agents\n2024 Salesforce Holiday Insights and Predictions Methodology\nPowered by Agentforce, Commerce Cloud, Marketing Cloud, and Service Cloud, Salesforce analyzed aggregated data to produce holiday insights from the activity of more than 1.5 billion global shoppers across more than 89 countries, with a focus on 18 key markets: the United States, Canada, United Kingdom, Germany, France, Italy, Spain, Japan, the Netherlands, Australia, New Zealand, the Asia-Pacific (excluding Japan, Australia, and New Zealand), Switzerland, Latin America (LAM), the Middle East and Africa (MEA), Eastern Europe, Belgium, and the Nordics. This battery of benchmarks provides a deep look into the last nine quarters and the current state of digital commerce. Several factors are applied to extrapolate macroeconomic figures for the broader retail industry. These and other results are not indicative of Salesforce performance.\nThe prediction data that we present are from proprietary Salesforce research. The calculations we use blend together first-party and third-party data, as well as several market assumptions.\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nCommerce\nData\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Life Sciences Cloud Now Selected by More than 70 Industry-Leading Customers to Scale Engagement and Improve Patient Outcomes\n8 min read\nHow Agentic AI Can Help Overcome the Child Welfare Information Crisis\n8 min read\nManufacturers Gain New AI Workforce: Salesforce’s Agentforce for Manufacturing Optimizes Production, Boosts Sales, and Cuts Downtime\n7 min read\nHow a Texas Boomtown Used AI to Reinvent City Government\n8 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1486, "token_count": 2159, "ingestion_ts": "2025-09-07T04:08:42.017568", "hash_sha256": "4da7a86ed2a17476f3e5f67c9aeb3c68f7afcb47e863f6157c2666e2deea555a", "html_title": "", "meta_published_time": "2025-01-06", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false}