{"doc_id": "crm::press::2024-05-25::salesforce-equality::874ae8c4", "company": "Salesforce", "doctype": "press", "title": "Equality at Salesforce", "publish_date": "", "url": "https://www.salesforce.com/company/equality/?bc=DB", "final_url": "https://www.salesforce.com/company/equality/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Partnership|Product", "persona_tags": ["general"], "language": "en", "text": "Equality at Salesforce | Salesforce US\nSkip to content\nEquality\nLet’s create an equal workplace and world for all.\nAt Salesforce, equality is one of our longstanding core values that helps us to innovate and drive business success. We are committed to building a workplace where every employee feels seen, supported, can thrive, and is empowered to perform the best work of their careers.\nMeet our equality groups.\nOur employees are at the center of everything we do. Our Equality groups are employee-led, open to all, and support our business through engagement, innovation, retention, and cultivating leadership skills.\nLearn more\n.\nWe are committed.\nWe are committed to driving equality for all of our stakeholders — employees, customers, partners, shareholders, and society at large. See how we're advancing this work.\nTrain with AI for All\nOur AI for All initiative offers free hands-on AI courses and certifications through 2025, a more than $50 million investment in training people for the jobs of tomorrow.\nRead more\nLead with Ethical and Humane Use\nWe work to ensure our products are developed and used ethically and uphold the fundamental human rights of every individual.\nRead more\nPartner with the Office of Accessibility\nWe strive to be accessibility Trailblazers, ensuring equal access to all our products and workplaces.\nRead more\nOur Commitment to Equal Pay for Equal Work\nWe address pay gaps by race and gender each year. In 2024, employees performing similar jobs were paid on par across genders globally and race in the U.S.\nRead more\nInvest in Education Worldwide\nWe have invested $100 million in San Francisco and Oakland public schools and more than $165 million worldwide.\nRead more\nSupport Equality for All\nWe advocate for equal opportunities and rights for everyone, including for LGBTQ+ communities, around the world. Learn more about our work to create a more innovative, sustainable, and equal world for all.\nRead more\nAI Equality Summit\nUncover the power and potential of AI and Agentforce, through insights from C-suite executives, founders, and tech leaders exploring the intersection of AI and Equality.\nWatch now\nCreate Access to Opportunity\nWe upskill Trailblazers through the Salesforce Military program and Trailhead. We also hire untapped talent through Year Up and Ada Developers Academy in the U.S., and apprenticeship providers like FIT and Multiverse in EMEA.\nRead more\nOur core value of Equality for all.\nOur value of equality is our competitive edge in driving innovation, engagement, and growth. We are committed to creating equal opportunities for all in the agentic future.\nAlexandra Legend Siegel\nChief Equality & Engagement Officer, Salesforce\nInterested in a career at Salesforce?\nAt Salesforce, we are demonstrating the power of humans and agents working together and our vision to bring everyone along in the future of Agentforce. Join us.\nSearch all jobs\nRead the latest\nequality report\n.\nEEO-1 and Equal Opportunity Policy\nOur annual EEO-1 Report is available for download below, representing employees as of 2024. Please note that due to the EEO-1 reporting schedule, the numbers reflected in the below form are representative of a point in time in December 2024, and not our current 2025 data. The EEO-1 Report is a snapshot in time of our U.S. demographics and based on categories prescribed by the federal government. These categories are not necessarily representative of how our industry or workforce is organized. The information provided on our Equality page is a more accurate representation of our progress toward diversity.\nTo align with U.S. government reporting requirements, data in this report uses categories of male and female. Salesforce deeply respects that gender is non-binary and different from sex assigned at birth; reporting in this manner does not represent our position.\nNote: Totals may not add to 100% due to rounding.\nDownload Employer Information EEO-1 Report.\nEqual Opportunity Employment Policy\nSalesforce is an equal opportunity employer and maintains a policy of non-discrimination with all employees and applicants for employment.\nWhat does that mean exactly? It means that at Salesforce, we believe in equality for all. And we believe we can lead the path to equality in part by creating a workplace that's diverse, inclusive, and free from discrimination.\nAny employee or potential employee will be assessed on the basis of merit, competence and qualifications – without regard to race, religion, color, national origin, sex, sexual orientation, gender expression or identity, transgender status, age, disability, veteran or marital status, political viewpoint, or other classifications protected by law.\nThis policy applies to current and prospective employees, no matter where they are in their Salesforce employment journey. It also applies to recruiting, hiring, job assignment, compensation, promotion, benefits, training, assessment of job performance, discipline, termination, and everything in between. Recruiting, hiring, and promotion decisions at Salesforce are fair and based on merit. The same goes for compensation, benefits, promotions, transfers, reduction in workforce, recall, training, and education.\nAt Salesforce, we strive to create an accessible and inclusive experience for all candidates. If you need assistance and/or an accommodation due to a disability during the application or the recruiting process, please send a request via the\nAccommodation Request Form\n.\nSEARCH JOBS\nJOIN OUR TALENT COMMUNITY\nFor information on Salesforce's commitment regarding your privacy, please see our\nCandidate Privacy Statement\n.\nTo manage your communication preferences, please visit our\nPreference Center\n.", "word_count": 881, "token_count": 1117, "ingestion_ts": "2025-09-06T21:57:16.879543", "hash_sha256": "6e506364ad4ea7c3f65b1ba0abc4912d812c7021edca69b003f2a3f2648f8c07", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "missing", "publish_date_confidence": 0.0, "was_fallback_today": false, "link_ok": true, "link_status": 200}