{"doc_id": "crm::press::2025-03-05::salesforce-launches-agentforce-2dx-new-capabilities-embed-pr::a14f1f36", "company": "Salesforce", "doctype": "press", "title": "Salesforce Launches Agentforce 2dx: New Capabilities Embed Proactive Agentic AI into Any Workflow, Create Multimodal Experiences, Extend Digital Labor", "publish_date": "2025-03-05", "url": "https://www.salesforce.com/news/press-releases/2025/03/05/agentforce-2dx-news/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/03/05/agentforce-2dx-news/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_sales_ops"], "language": "en", "text": "Agentforce 2dx News Announcement - Salesforce\nSkip to Content\nSkip to Footer\n0%\nAgents\nSalesforce Launches Agentforce 2dx: New Capabilities Embed Proactive Agentic AI into Any Workflow, Create Multimodal Experiences, Extend Digital Labor\nMarch 5, 2025\n14 min read\nMedia Library\nAgentforce 2dx enables Agentforce to engage proactively, be triggered on changes in data, operate autonomously in the background of any business process, and interact with users across any user interface with rich content and media\nNew low-code and pro-code tools empower admins and developers to confidently configure, test, and deploy Agentforce faster with AI-powered assistance\nAgentExchange, the trusted Agentforce marketplace built into Salesforce, will accelerate the deployment of AI agents with ready-to-use partner and community-built actions and agents\nCustomers such as The Adecco Group, Engine, OpenTable, Oregon Humane Society, Precina, and Vivint have adopted Agentforce, transforming how their businesses run with digital labor\nSAN FRANCISCO – March 5, 2025 – Salesforce (NYSE: CRM), the #1 AI CRM, today announced Agentforce 2dx, the newest version of\nAgentforce\n, its digital labor platform for bringing trusted,\nautonomous AI agents\ninto the flow of work. In this release, Agentforce is expanding beyond the reactive, user-initiated world of chat interfaces and enabling proactive AI agents to work behind the scenes, without constant human oversight, to unlock new customer and employee workflows of any kind. Organizations can now seamlessly integrate autonomous agents into their existing data systems, business logic, and user interfaces, enabling agents to anticipate business needs and dynamically take action‌ — ‌improving efficiency, agility, and scale.\nAgentforce 2dx also marks the release of a new set of low-code and pro-code tools for Salesforce developers to confidently configure, test, and deploy Agentforce faster, paired with advanced analytics to help teams monitor, debug, and optimize agent performance with real-time data and guidance. To experiment with these tools, Salesforce now offers the Agentforce Developer Edition, a completely free environment where developers can prototype agents using Agentforce and also explore the capabilities of\nData Cloud\n, Salesforce’s hyperscale data engine.\nOpen Image Modal\nImage Modal\nAdditionally,\nSalesforce announced AgentExchange\n, the trusted marketplace and community for Agentforce that is built into Salesforce, opening up new opportunities for partners to participate in the rapidly expanding\n$6 trillion digital labor market opportunity\n. AgentExchange will accelerate Agentforce deployments with a library of ready-to-use templates and actions, saving businesses time and resources while enabling partners to list their components for sale and capture their share of the growing AI agent market. AgentExchange launches with more than 200 initial partners and hundreds of ready-made actions — each having passed a rigorous security review and backed by customer reviews — to quickly create and deploy AI agents across multiple professions and industries.\nOpen Image Modal\nImage Modal\nAgentforce 2dx, paired with the new developer tools and AgentExchange, launches with the\nAgentblazer\ncommunity, an inclusive group for Salesforce admins, developers, CTOs, CIOs, and other IT leaders who can share best practices and learn skills on Trailhead to create agent-first companies.\n“Companies today have more work than workers, and Agentforce is stepping in to fill the gap. By extending\ndigital labor\nbeyond CRM, we’re making it easier than ever for businesses to embed agentic AI into any workflow or application to handle routine tasks, augment employees, and connect with customers. With deep integrations across Salesforce’s digital labor platform, CIOs, IT leaders, and developers can seamlessly build agents and automate work wherever it happens, driving efficiency, fueling innovation, and unlocking new opportunities in the $6 trillion digital labor market.”\n– Adam Evans, EVP and GM of Salesforce’s AI Platform\nBy extending digital labor beyond CRM, we’re making it easier than ever for businesses to embed agentic AI into any workflow or application to handle routine tasks, augment employees, and connect with customers.\nAdam Evans, EVP and GM of Salesforce’s AI Platform\nWhy it matters:\n96%\nof developers believe\nAI agents\nwill positively reshape the developer experience.\nAgentic AI\nrepresents the next evolution of automation, where AI-driven agents operate independently to execute tasks, make decisions, and optimize workflows without constant human oversight. Unlike traditional AI chatbots, which require manual prompts or rigid programming, agentic AI dynamically responds to live data and evolving business needs. Salesforce’s latest agentic AI enhancements represent a major leap in how organizations integrate agents into daily operations. By embedding\nAI\nseamlessly into apps, workflows, and processes, enterprise-ready AI agents won’t just assist‌ — ‌they’ll act.\n“OpenTable is partnering with Salesforce’s Agentforce Platform to help OpenTable’s customer service agents better serve our restaurants and diners. Three weeks in, it is handling 73% of all restaurant web queries. This is a 50% improvement from our previous tool and we expect this number to further increase once Agentforce is launched to the general audience.”\n‌ — George Pokorny, Senior VP of Global Customer Success at OpenTable\nWhat’s new\nOrchestrate Agentforce across any experience or system\nDeploying autonomous agents for every customer and employee interaction used to require a complex implementation strategy. Now, admins and developers have even more  capabilities to embed Agentforce anywhere and tailor for every use case with new tools like:\nAgentforce API:\nIntegrate Agentforce in back-end processes, other systems, and directly into applications with the new Agentforce API. For example, customers can trigger an agent when an ERP order is created or kick off a loan application process automation to verify whether documents have the required information.\nAgentforce Invocable Actions:\nAgentforce can now be embedded within Salesforce business logic, like Flow and Apex. This allows customers to blend classic workflow automation with agentic\nreasoning\n. For example, customers can trigger an agent when an opportunity moves to a certain stage to reason over the best next steps, and kick off email updates or approvals accordingly.\nMuleSoft for Agentforce:\nMuleSoft Topic Center allows developers to use natural language to create Agentforce topics and actions from MuleSoft APIs. The MuleSoft API Catalog simplifies AI agent development by centralizing access to diverse APIs from MuleSoft, Salesforce, and Heroku within Agentforce. It provides a secure, governed hub for admins to quickly expand agent capabilities with pre-built topics and actions from across their ecosystems. The MuleSoft Agentforce connector allows developers to integrate Agentforce into existing workflows, enabling APIs and integrations to trigger agents for data enrichment and action execution across systems.\nAgentforce Steps in Slack Workflow Builder:\nEnables developers to embed Agentforce into no-code automations in Slack. Trigger Agentforce from Slack events, and pass Slack conversational context back to Agentforce without needing to rely on user-initiated action.\nAgentforce Employee Template:\nEasily deploy Agentforce for employee use cases across Slack and Salesforce with a new Agentforce template. Agentforce Employee Template allows customers to create multiple employee agents that can be configured and deployed across any line of business.\nAgentforce Surfaces:\nIntelligently deliver rich content within Agentforce across all Digital Engagement channels. Intelligently add dynamic, interactive components and media that are channel and device specific to better customize how Agentforce shows up across channels.\nAgentforce Cards:\nEmbed Lightning web components within the response of Agentforce actions. Reuse existing Salesforce components to give more context, information, and functionality to Agentforce.\nTableau Semantics:\nCreate clear and organized data structures – semantic models —  that Agentforce can take advantage of. Tableau enriches agents with real-time business context, so they can provide more accurate insights and answers.\nConfidently configure, test, and deploy with new tools\nAgentforce includes new pro-code and low-code tools to help admins and developers ideate, build, deploy, and supervise their Agentforce across their organization. These tools are part of the deeply unified Salesforce Platform, so they are fully integrated into the workflows developers use every day, like DevOps Center and the Command Line Interface (CLI).\nAgentforce Developer Edition:\nA new free environment for accessing Agentforce and Data Cloud to get started on prototyping first use cases. Agentforce Developer Edition includes 10GB of access to Data Cloud, and 150 LLM generations per hour.\nAI assistance in Agent Builder:\nTeams can now put Agentforce into production faster and with more confidence with AI-powered topic and instruction creation to help quickly configure agents that adhere to best practices. AI Assist also helps teams troubleshoot answers that Agentforce provides and give guidance on how to improve the underlying topic and instructions.\nTesting Center:\nTeams can easily test their Agentforce configurations at scale using AI. And they can automatically generate and run test cases in Testing Center in their Salesforce Sandbox. Teams can also evaluate how well Agentforce configurations are adhering to guardrails like faithfulness or context relevance.\nOpen Image Modal\nImage Modal\nCLI and VS Code Support:\nDevelopers can now create, update, and test Agentforce configurations using the CLI and VS code. All aspects of Agentforce configurations can be created and updated with pro-code tools, and test cases can be run against these configurations.\nOpen Image Modal\nImage Modal\nDX Inspector:\nExplore and understand all of the metadata and data used by Agentforce, including agent topics and actions, inside your Salesforce Sandbox. Easily make and track changes to the metadata while configuring agents in Agent Builder through the side panel.\nAgentforce Interaction Explorer:\nDetailed reporting and analytics about how Agentforce is performing, from general trends down to individual session tracing. Understand each user request, the reasoning steps associated with the response, and see AI-powered recommendations to help continuously refine topics and instructions to improve agent performance.\nOpen Image Modal\nImage Modal\nAnalyst perspective\nAgentic AI promises to deliver exponential benefits from AI by automating complex tasks and interactions without human intervention. However, creating agentic AI that can handle complex tasks with acceptable performance has been a challenge. Industry analyst Valoir found using a platform optimized for agentic AI development like Salesforce Agentforce enables organizations to deliver autonomous AI agents an average of 16 times faster than other approaches while increasing accuracy by 75%.\nFuturum Research found organizations using Agentforce can achieve ROI up to five times faster and with at least a 20% lower total cost of ownership, enabling them to outpace competitors and streamline operations at scale. Companies using Agentforce have reported 40% faster case resolution times and 25% higher lead conversion rates, directly affecting revenue and customer retention.\n“89% of CIOs identify AI and automation as critical to their digital strategy in 2025, yet 60% of AI projects fail to deliver clear ROI. Agentforce bridges this gap with pre-built workflows that deliver measurable impact fast. While DIY agent-based AI projects can take up to a year to implement, Agentforce customers go live in just 4-6 weeks, realizing value 3-4 times faster. As AI agents become embedded across business operations, from engineering to go-to-market, they will fundamentally reshape how teams engage with customers and partners. Instead of siloed interactions across CRM, support platforms, and marketing tools, AI agents can coordinate responses, escalate issues, and optimize workflows in real time. Companies that harness this shift — especially in their partner ecosystems — will gain a competitive edge in both performance and market reach.”\n– Dion Hinchcliffe, VP and Practice Lead, CIO Insights, Futurum Group\nBuild the future with Agentforce.\nSalesforce Launches AgentExchange: the Trusted Marketplace for Agentforce\nFrom Zero to a Billion: Why Metadata Is Key to Building a Massive AI Agent Ecosystem\n92% of Developers Report AI Agents Will Help Advance Their Careers\nAgentforce Brings Vivint Customer Service Teams 24/7 Support\nCustomers realize immediate value\nAdecco Group, the world’s leading talent company, is harnessing the power of Data Cloud and Agentforce to create a deeply\nunified platform\nthat redefines the recruitment landscape. By centralizing more than 40 instances of their data using\nMuleSoft\nand Data Cloud, Adecco will streamline operations and enhance efficiency.\n“Agentforce is completely transforming our recruitment process. By automating resume screening and using AI to engage with millions of candidates, we can connect with every applicant and make sure they feel valued and informed. This not only improves the experience for candidates but also frees up our recruiters to focus on building meaningful relationships, all while boosting our efficiency and scalability.” ‌‌—\nGreg Shewmaker, Senior Vice President of Global Operations and AI at The Adecco Group\nEngine, the modern travel platform for business trips and events, aims to achieve nearly $1.9 million in total annualized benefits, shorten average handle time for cancellation requests and email responses by 15%, and manage up to 30% of incoming customer inquiries with agents.\n“With Agentforce, we’ve built multiple AI agents that power various parts of our business, addressing every stage of the customer lifecycle. By managing a significant portion of incoming customer inquiries, Agentforce serves as a vital\ndigital labor\nplatform that enhances our customer service workforce. The AI agents handle cancellation requests end-to-end without needing human escalation, using CRM data to provide accurate responses. This streamlines our operations and allows our teams to focus on high volumes of FAQs across chat, email, and phone calls.”\n— Elia Wallen, Founder and CEO at Engine\nPrecina, a company transforming healthcare for patients with type 2 diabetes, is\nusing Agentforce\nto tap into Salesforce’s deeply unified platform to instantly access their medical records, lab results, and prescription history.\n“Agentforce has completely transformed the way we support both patients and providers. By automating contracting and providing AI-driven coaching, our providers can spend less time on administrative tasks and more time delivering the care that truly makes a difference. This shift not only enhances patient support but also will help us save an estimated $80,000 each year for every 5,000 patients in reduced administrative overhead.”\n‌‌— John Oberg, Founder & CEO at Precina\nOregon Humane Society, the largest animal welfare organization in the Northwest, is using MuleSoft to streamline their operations, from automating animal meet-and-greet scheduling and donation processes to connecting various systems and apps. By integrating data across their organization, Oregon Humane Society is able to get better insights for fundraising and marketing, reduce manual effort, and save significant time and resources.\n“As an early adopter, we leveraged MuleSoft to seamlessly connect Salesforce and NetSuite. This automated process for auditing and tracking closed opportunities against daily online donations has drastically reduced manual effort and significantly saved time.” –\nAndrew Shanks, Salesforce Solution Architect at Oregon Humane Society\nVivint, a leading provider of smart home and security solutions, is transforming customer service with Agentforce, harnessing the power of AI to deliver seamless and efficient support for its expanding smart home customer base. By integrating Agentforce, the company can automate tasks to help customers answer common questions and support specialists on complex cases, leading to faster resolutions and a more streamlined and personalized customer experience.\n“\nAgentforce has given Vivint an opportunity to transform the way we interact with our customers. Its ability to automate intricate tasks helps our customers get support around the clock and empowers our specialists to focus on delivering a smarter, more seamless customer experience.\n” –\nRyan Gee, Senior Vice President, Engineering at Vivint\nAvailability\nThe full release of Agentforce 2dx will be generally available in April 2025, with specific features being released in advance beginning today.\n‌AgentExchange is available today at\nAgentExchange.Salesforce.com\n.\nAgentforce Developer Edition is available today at\ndeveloper.salesforce.com/signup\n.\nAgent Builder\nwith AI assist will be available in March 2025 and will be included with Agentforce.\nTesting Center Enhancements for evaluating guardrails will be available in April 2025 and will be included with Agentforce.\nAgentforce Employee Agent will be available in April 2025 and will be included with Agentforce.\nMuleSoft for Agentforce is available now, Topic Center is included with every Anypoint license, and API Catalog is included with Salesforce and requires MuleSoft to access the MuleSoft API.\nAgentforce Invocable Actions are generally available now.\nAgentforce API is generally available now.\nDX Inspector is generally available now.\nAgentforce Interaction Explorer will be available in the Fall of 2025.\nLearn More:\nLearn about the new\nAgentExchange\nmarketplace and community\nGet details on how an expanded\nSalesforce-Google partnership\nwill give businesses more AI model and capability choices\nRead what\nFuturum Research\nand\nValoir\nare saying about Agentforce vs. DIY approaches\nCheck out how customers like\n1-800Accountant\n,\nPrecina\n, and\nUnity Environmental University\nare becoming more efficient and improving outcomes with Agentforce\nLearn about\nAgentforce for Health\n— agentic skills and actions for healthcare pros\nUnderstand how\nAI agents will become the new UI\nwith apps taking a back seat\nFind out how\nambient agents\n, operating behind the scenes, will autonomously reshape how businesses operate and innovate\nDiscover why\nAI models matter less\nthan having a deeply unified platform\nUnderstand why\n92% of developers\nbelieve AI agents will advance their careers\nRead why\nmetadata is key\nto building a massive AI agent ecosystem\nLearn more about the new\nSalesforce Developer Edition\nnow with Agentforce and Data Cloud\nThis article may include references to services or features that are still in development and are unreleased. Customers should make their purchase decision based on fully released and available features.\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nDigital Transformation\nEnterprise AI\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nSalesforce Life Sciences Cloud Now Selected by More than 70 Industry-Leading Customers to Scale Engagement and Improve Patient Outcomes\n8 min read\nHow Agentic AI Can Help Overcome the Child Welfare Information Crisis\n8 min read\nManufacturers Gain New AI Workforce: Salesforce’s Agentforce for Manufacturing Optimizes Production, Boosts Sales, and Cuts Downtime\n7 min read\nHow a Texas Boomtown Used AI to Reinvent City Government\n8 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 3141, "token_count": 4234, "ingestion_ts": "2025-09-07T04:08:46.144303", "hash_sha256": "c7d4a6e332b25a7d85086f9399f8acf9dec861b8d215b2ba82d1c097fb5e1fd8", "html_title": "", "meta_published_time": "2025-03-05", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false}