{"doc_id": "crm::press::2024-06-30::salesforce-sustainability::d42ed8dd", "company": "Salesforce", "doctype": "press", "title": "Sustainability", "publish_date": "", "url": "https://www.salesforce.com/company/sustainability/?bc=DB", "final_url": "https://www.salesforce.com/company/sustainability/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Partnership|Product", "persona_tags": ["cio"], "language": "en", "text": "Sustainability | Salesforce US\nSkip to content\nSustainability at Salesforce\nCollective action is the only way forward.\nWe are committed to sustainability and use the full power of Salesforce to help our customers achieve their environmental goals.\nNet Zero Cloud\nAI Agents for Sustainability\nSustainability at Salesforce\nAI Sustainability\nCustomer Zero\nNature Positive Future\nEcopreneur Revolution\nAI Sustainability\nWe work across our business to advance trusted and sustainable AI solutions.\nRead our AI Sustainability Outlook\nMeet the AI Energy Score\nRead our Sustainable AI Policy Priorities\nBuild a Sustainable AI Strategy\nHow Salesforce uses Agentforce for Sustainability\nLearn how the Salesforce impact team is using Agentforce to enhance operations and advance sustainability initiatives.\nLearn more\nNature Positive Future\nWe’re committed to a net zero, nature positive future.\nJoin the trillion trees movement\nExplore our Nature Positive Strategy\nOur commitment to 100M trees by 2030\nBecome a tree champion on Trailhead\nEcopreneur Revolution\nWe invest in ecopreneurs to scale sustainability and nature solutions.\nLearn about our model for impact innovation\n​​Apply for Salesforce Accelerator — Agents for Impact\nWatch the Climate and AI Summit on Salesforce+\nSustainability is a core value at Salesforce.\nFor more than a decade, we've been embedding sustainability into everything we do—cutting emissions and driving efficiency across the business.\nLearn more in our Stakeholder Impact Report\nSee what’s new in sustainability.\nCustomer & Partner Stories\nResources\nCustomer Story\nInvesting in Coastal Communities with Agentforce\nWith Agentforce, ORRAA and 2050 are powering the Octopus Platform — a sustainable blue economy matchmaking tool that connects investors with blue projects.\nWatch now\nCustomer Story\nRouting Disaster Recovery Donations 3x Faster with Agentforce\nAI agents help Good360 distribute more unused goods and lower their carbon footprint by up to 20%.\nLearn more\nCustomer Story\nHow Farmers Can Scale Sustainability with Agentforce\nGoAP intends to work with Producers Trust and Salesforce to innovate an Agentforce platform strategy to enable market and finance developments.\nWatch now\nThe Gap in Sustainable Value Creation Report\nAgentforce for Net Zero Cloud\nThe Sustainability Value Triangle Report\nYour Guide to Sustainability Transformation\nSustainability at Salesforce FAQs\nWhat is Salesforce doing for sustainability? How is Salesforce sustainable?\nSalesforce has been on a sustainability journey for over a decade. We’re driving meaningful change through innovation, partnerships, strategic investments, and bold leadership. From our operations to our technology solutions, we empower businesses and communities to accelerate their sustainability goals. We commit to a sustainable future by minimizing energy usage, innovating with sustainable AI advancements, decarbonizing our operations, and promoting a nature-positive world.\nWhat is Salesforce’s approach to AI sustainability?\nAI sustainability is critical for a healthy business and healthy planet. Developed through close partnership with\nAI Research\n,\nSustainability, and the\nOffice of Ethical and Humane Use\n, Salesforce’s AI sustainability strategy focuses on on three main pillars: smart demand (using AI wisely), efficiency (doing more with less), and clean supply (powering AI with low-impact resources) Learn more\non Trailhead\n.\nWhat is Salesforce's carbon credit strategy?\nToday, there's both excitement about the growth of the voluntary carbon market and concern about the quality of carbon credits and their ability to deliver on their intended benefits. While not perfect, carbon markets are vital for financing climate solutions. They’re not a standalone solution but should be part of a comprehensive strategy. Salesforce believes in our collective ability to mitigate the risks of carbon markets and seize their immense potential. Learn more about our approach\nhere\nand view our portfolio\nhere\n.\nWhat is 1t.org?\nForests are the lungs of our planet. That’s why we are a founding partner of the trillion trees initiative, 1t.org, a global movement to conserve, restore, and grow healthy forest ecosystems globally by 2030. As part of our commitment to 1t.org, Salesforce set a goal to help fund the conservation, restoration, or growth of an additional 100 million trees by the end of the decade, and we’re proud to have helped fund more than 46 million trees in three short years. You can track our progress here.\nCan we really plant 1 trillion trees?\nThe Trillion Trees movement aims to secure an additional trillion trees in biodiverse forests through conservation, restoration, and growth — not just planting new ones. Global forest destruction is alarming, with about 10 million hectares lost yearly. Urgent action is needed to prevent the loss of rainforests, like the Amazon, where 18% deforestation risks converting it into savanna. Scientific research highlights the potential of restoring 2.2 billion acres (900 million hectares) of degraded land by growing 1–1.2 trillion trees. Adding more trees can include trees in cities, on farms through agroforestry, and by restoring existing forests and forest landscapes.\nImpact News\nNews\nSalesforce Employees Reach 10M Volunteer Hours\nLearn More\nNews\nSalesforce Launches Agentforce for Net Zero Cloud\nLearn more\nNews\nMeet the Digital Workforce Scaling Up Sustainability and Climate Disaster Response\nLearn More\nNews\nWhere Nature Meets AI: Salesforce’s Model for Impact Innovation\nLearn More\nSee more news", "word_count": 826, "token_count": 1083, "ingestion_ts": "2025-09-07T02:42:34.636311", "hash_sha256": "263ea0ae41d6dff5df55be75a95c9d0d438e8218eaa3db293f0235511e8ea1bc", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "missing", "publish_date_confidence": 0.0, "was_fallback_today": false, "link_ok": true, "link_status": 200}