{"doc_id": "crm::product::2024-01-01::what-is-salesforce::17018047", "company": "Salesforce", "doctype": "product", "title": "What is Salesforce?", "publish_date": "", "url": "https://www.salesforce.com/products/what-is-salesforce/?bc=DB", "final_url": "https://www.salesforce.com/products/what-is-salesforce/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_customer_experience", "vp_sales_ops"], "language": "en", "text": "What is Salesforce? | Salesforce US\nSkip to content\nWhat is\nSalesforce?\nSalesforce is the world’s leading customer relationship management technology (\nWhat is CRM?\n), helping you build and improve your customer relationships. Our\nStarter Suite\nmakes it easy for small businesses to get organized and grow with the #1 AI CRM. And we’re helping organizations of all sizes unify their data and re-imagine their business for the world of AI with\nAgentforce\n, providing autonomous AI agents that take action for your employees and customers.\nLaunch interactive demo\nTry Starter Suite free\nWhat does Salesforce do?\nSalesforce helps you stay ahead of changing customer expectations with data tools, trusted AI, and best-in-class apps for sales, service, marketing, commerce, and IT — all on one integrated platform. With Salesforce, your employees can be more productive with a single view of customer data that keeps every team in sync. And Agentforce works side-by-side with humans, speeding up processes and taking action autonomously. All so you can win more business, while making your existing customers happier with personalized experiences.\nWhat AI was meant to be.\nMeet Agentforce — your team of\nAI agents\nthat assist employees with tasks and take action to help you boost productivity and serve customers better. Seamlessly transfer from proactive AI agents to humans. Build custom agents with low-code and natural language tools.\nExplore Agentforce\nCalculate your ROI\nSell faster, smarter, and more efficiently.\nArm your sales organization with the tools and data they need to close deals faster. With Salesforce, you can scale your sales team without limits. Agentforce helps you nurture inbound leads to build pipeline, and gives every sales rep a dedicated AI coach to practice their pitches, handle objections, and negotiate before customer meetings.\nWatch sales demo\nLearn about Sales Cloud\nDeliver effortless service 24/7.\nProvide consistent, personalized support experiences across your customers’ preferred channels — from the contact center to out in the field. Agentforce serves customers at any time, and seamlessly escalate to service representatives when needed.\nWatch service demo\nLearn about Service Cloud\nBuild long-lasting relationships that drive growth.\nEngage with your customers across the entire life cycle. Agentforce dynamically generates personalized journeys, marketing campaigns, and audience-specific content across email, mobile, web, and advertising – all in your brand voice and optimized based on past performance.\nWatch marketing demo\nLearn about Marketing Cloud\nGrow revenue with seamless buying experiences.\nOffer frictionless digital commerce experiences that natively connect B2C, B2B, order management, and payments with your sales, service, and marketing apps. And with Agentforce in the mix, you can now give every customer a dedicated personal shopper that delivers personalized recommendations and streamlines purchases.\nWatch commerce demo\nLearn about Commerce Cloud\nMany Salesforce products. One integrated platform.\nOur complete product portfolio includes CRM apps for sales, service, marketing, commerce, and more with trusted AI and data on one integrated platform. Whatever size your business, whatever your industry, there’s a solution tailored to you.\nSee all products\nAll sorts of companies, big and small, grow their businesses with Salesforce.\nSee customer stories\nWe support our customers' success. We’re honored to be recognized for it.\nVoted #1 Grid® leader in 170 categories, with 88,258 reviews and an average 4.4 star rating.\nLearn more\nSalesforce is ranked #1 for CRM Applications based on IDC 2024H1 revenue market share worldwide.*\nLearn more\nGartner has named Salesforce a Leader in Customer Data Platforms.\nLearn more\n* IDC, Worldwide Semiannual Software Tracker, April 2024. CRM market includes the following IDC-defined functional markets: Sales Force Productivity and Management, Marketing Campaign Management, Customer Service, Contact Center, Advertising, and Digital Commerce Applications.\nSalesforce is a platform for change.\nFrom the start, Salesforce has been on a mission to help businesses succeed, and to use business success to drive positive change for people and our planet.\nSee the Salesforce story\nSalesforce is your go-to source for business insights.\nLearn how economic shifts have reshaped customer expectations.\nRead the report\nSee how Salesforce CIO Juan Perez deployed over 70 generative AI technologies.\nWatch now\nAgents are set to become ubiquitous across every area of our lives.\nRead more\nSee more resources\nDiscover our latest demos, insights, and reports.\nLearn more about Salesforce CRM.\nGet guided learning on all things related to Salesforce through Trailhead, Salesforce’s free online learning platform.\nStart learning\nSee Salesforce in action.\nWatch our demos to see how Salesforce connects your teams so you can drive business success and wow customers.\nWatch demos\nTry Salesforce Starter Suite for free.\nGet marketing, sales, service, and analytics tools together on one integrated platform.\nStart free trial\nFAQs\nWhat does SFDC stand for? What is SFDC?\nSimply put, SFDC is an acronym for SalesforceDotCom.\nSFDC stands for Salesforce.com, which is a cloud-based customer relationship management (CRM) and agentic AI platform. It is one of the most popular and widely used CRM software platforms in the market, and is used by businesses of all sizes to manage their customer data, sales processes, marketing campaigns, and customer service activities with the power of AI agents and unified data. The acronym SFDC is often used as a shorthand for Salesforce.com in discussions, literature, and online forums related to the software.\nWhat is SFDC in Salesforce?\nSFDC stands for Salesforce.com. It's a cloud-based customer relationship management (CRM) platform used by businesses to manage customer data, track sales, and automate various business processes. While the company is simply known as \"Salesforce\" now, the older acronym \"SFDC\" continues to be used, particularly within the Salesforce ecosystem.\nWhat is SFDC used for?\nSFDC is a deeply integrated, cloud-based software platform that helps businesses manage customer relationships with the help of agentic AI, data tools, and CRM apps. It offers tools for sales tracking, customer service, marketing automation, and data analysis. By centralizing customer information, SFDC enables teams to collaborate effectively and make informed decisions to enhance customer satisfaction and drive growth.", "word_count": 982, "token_count": 1262, "ingestion_ts": "2025-09-07T02:42:35.002933", "hash_sha256": "3fb86db2f7b79cd208a7b75ca6a328928b9e867e8e3d2335377260ba49739a23", "html_title": "", "meta_published_time": "", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "missing", "publish_date_confidence": 0.0, "was_fallback_today": false, "link_ok": true, "link_status": 200}