{"doc_id": "crm::press::2025-06-23::salesforce-launches-agentforce-3-to-solve-the-biggest-blocke::0d47e9a6", "company": "Salesforce", "doctype": "press", "title": "Salesforce Launches Agentforce 3 to Solve the Biggest Blockers to Scaling AI Agents: Visibility and Control", "publish_date": "2025-06-23", "url": "https://www.salesforce.com/news/press-releases/2025/06/23/agentforce-3-announcement/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/06/23/agentforce-3-announcement/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio", "vp_customer_experience", "vp_sales_ops"], "language": "en", "text": "Salesforce Announces Agentforce 3 - Salesforce\nSkip to Content\nSkip to Footer\n0%\nAgents\nSalesforce Launches Agentforce 3 to Solve the Biggest Blockers to Scaling AI Agents: Visibility and Control\nJune 23, 2025\n13 min read\nMedia Library\nNew Agentforce Command Center provides a complete observability solution for optimizing AI agents\n—\nenabling leaders to manage, track, and scale how AI agent activity enhances human productivity\nAgentforce 3 enables seamless agent interoperability with built-in support for open standards like Model Context Protocol (MCP). Through the expanded AgentExchange, customers will be able to access plug-and-play services from over 30 partners, including AWS, Box, Cisco, Google Cloud, IBM, Notion, PayPal, Stripe, Teradata, WRITER, and more\nAgentforce 3 delivers an updated Atlas architecture — from reasoning, to performance, to trust — for unmatched enterprise readiness, including lower latency, greater accuracy, enhanced resiliency, and support for natively hosted LLMs such as Anthropic\nCustomers like Engine, Grupo Globo, PepsiCo, UChicago Medicine, and 1-800Accountant are realizing fast time-to-value with 100+ new, pre-built industry actions, flexible pricing, and expanded availability\nSAN FRANCISCO – June 23, 2025\n–\nSalesforce (NYSE: CRM), the world’s #1 AI CRM, today announced Agentforce 3: a major upgrade to its digital labor platform that gives companies the visibility and control to scale\nAI agents\nwithout compromise. As enterprise adoption accelerates, the real blocker has become clear: teams can’t see what agents are doing — or evolve them fast enough. Agentforce 3 changes that. Built on learnings from thousands of Agentforce deployments since its initial launch in October 2024,\nAgentforce\nWith a new Command Center for complete observability, built-in support for Model Context Protocol (MCP) for plug-and-play interoperability, and over 100 new prebuilt industry actions to speed time to value, Agentforce 3 helps companies scale what works, fix what doesn’t, and unlock the full potential of\nagentic AI\n— with clarity, control, and speed.\nWhy it Matters:\nAI agent adoption is surging. According to a soon-to-be-released Slack Workforce Index, AI agent usage is up 233% in six months, and over that same period, 8,000 customers have signed up to deploy Agentforce. But until now, agent platforms have lacked the tooling, governance, and observability needed to scale enterprise-wide. Agentforce 3 closes this gap — delivering the complete visibility, secure tool integration, and enterprise-grade controls organizations need to make agent velocity their competitive advantage.\n“With Agentforce, we’ve unified agents, data, apps, and metadata to create a digital labor platform, helping thousands of companies realize the promise of agentic AI today,” said Adam Evans, EVP & GM of Salesforce AI. “Over the past several months, we’ve listened deeply to our customers and continued our rapid pace of technology innovation. The result is Agentforce 3, a major leap forward for our platform that brings greater intelligence, higher performance, and more trust and accountability to every Agentforce deployment. Agentforce 3 will redefine how humans and AI agents work together — driving breakthrough levels of productivity, efficiency, and business transformation.”\nWith Agentforce, we’ve unified agents, data, apps, and metadata to create a digital labor platform, helping thousands of companies realize the promise of agentic AI today.\nAdam Evans, EVP & GM of Salesforce AI\nAgentforce Command Center — Monitor, Measure, and Optimize Your AI Agents:\nAs AI agents take on routine tasks and begin collaborating more closely with human teammates, teams need a new observability layer built for the era of\ndigital labor\n. Agentforce Command Center is that layer: a complete observability solution that gives leaders a unified pane of glass to monitor agent health, measure performance, and optimize outcomes. Built into Agentforce Studio, it completes the agent lifecycle with powerful tools to understand and refine agents at scale.\nUncover patterns across interactions to optimize your agents:\nCommand Center empowers teams to analyze every AI agent interaction, drill into specific moments, understand trends in usage, and see AI-powered recommendations for tagged conversation types to continuously improve your Agentforce.\nTrack agent health and intervene in real time:\nGet live, detailed analytics for latency, escalation frequency, and error rates, plus real-time alerts when the unexpected happens, so teams can act fast and keep agents running smoothly.\nUnderstand what’s working, and where to improve:\nCommand Center offers detailed dashboards that track agent adoption, feedback, success rates, cost, and topic performance — so teams can see what’s gaining traction and where to improve.\nSee what your agents are doing — in the tools your teams already use:\nAgentforce captures all agent activity in a native, extensible session-tracing data model in\nData Cloud\n— powering analytics, monitoring, and real-time alerting. Built on the OpenTelemetry standard, these agent signals integrate seamlessly with tools your teams already use, including Datadog, Splunk, Wayfound, and other monitoring partners for end-to-end visibility across your existing stack.\nDeliver a configurable Command Center for every team:\nMonitor AI agents alongside human teammates — right in the flow of work. Starting with\nService Cloud\n, agent activity will surface in real-time wallboards so contact center supervisors can track performance and escalate fast. And over time, every department will have a Command Center purpose-built for optimizing their agents.\nBuild and test agents fast with AI-assisted development tools:\nIn Agentforce Studio, use natural language to generate topics, instructions, and test cases. Testing Center simulates behavior at scale with state injection and AI-driven evals — so you can pressure-test your agents before going live.\n“Agentforce autonomously resolved 70% of 1-800Accountant’s administrative chat engagements during the peak this past tax season, an incredible lift during one of our busiest periods. But that early success was just the beginning. We’ve established a strong deployment foundation and weekly are focused on launching new agentic experiences and AI automations through Agentforce’s newest capabilities. With a high level of observability, we can see what’s working, optimize in real time, and scale support with confidence,” said Ryan Teeples, Chief Technology Officer at 1-800Accountant.\nIntroducing Agentforce 3\nHow Salesforce’s Open Ecosystem Is Driving Trusted Agent Interoperability\nWatch: Top News Moments from the Agentforce 3 Keynote\nPepsiCo Leverages Salesforce’s Agentforce to Advance AI Agenda\nSalesforce Collaborates with UChicago Medicine to Enhance Patient Support\nEnabling Secure Enterprise Connectivity with MCP and A2A Support:\nAI agents can’t drive impact if they can’t take action using the tools your business relies on. As open standards like Model Context Protocol (MCP) gain traction, they bring new opportunities for interoperability, but also challenges around governance, identity, and control. Agentforce 3 solves this by pairing open connectivity with enterprise-grade trust — giving agents native access to the tools they need, without compromising on control.\nMCP support built natively into Agentforce:\nAgentforce will include a native MCP client, enabling Agentforce agents to connect to any MCP-compliant server — no custom code required. Like a “USB-C for AI,” this enables access to enterprise tools, prompts, and resources — governed by your existing security policies.\nTurn APIs into MCP servers instantly with MuleSoft:\nLeveraging new MCP connectors, MuleSoft converts any API and integration into an agent-ready asset, complete with security policies, activity tracing, and traffic controls — empowering teams to orchestrate and govern multi-agent workflows.\nEasily host and manage custom MCP servers with Heroku:\nHeroku Managed Inference and AppLink make it fast and easy to deploy, register, maintain, and connect your custom MCP servers. With Heroku’s secure infrastructure and DevOps automation, developers can bring trusted custom actions to Agentforce with less friction.\n“Salesforce’s open ecosystem approach, especially through its native support for open standards like MCP, will be instrumental in helping us scale our use of AI agents with full confidence. We’ll be able to securely connect agents to the enterprise systems we rely on without custom code or compromising governance. That level of interoperability has given us the flexibility to accelerate adoption while staying in complete control of how agents operate within our environment,” said Mollie Bodensteiner, SVP of Operations at Engine.\nExpanding the AgentExchange — a Leading AI Agent Ecosystem — to Make Agent-First Tools Easy to Discover and Use:\nAs organizations embed AI agents across their teams, AgentExchange already makes it easy to equip them with the trusted tools they need to drive value fast with partner-built agent actions and templates. Now, customers will be able to\ndiscover MCP servers from 30+ partners\nthat provide trusted access to new third-party tools and resources and seamlessly connect them to Agentforce through a secure AI agent gateway. Launch MCP partners include AWS, Box, Cisco, Google Cloud, IBM, Notion, PayPal, Stripe, Teradata, WRITER, and more.\nCustomers will be able to leverage MCP Servers through AgentExchange from leading partners, including:\nAWS:\nAgentforce will enable agents to unlock critical insights from vast repositories of unstructured data stored on AWS, leveraging a suite of MCP servers such as the Amazon Bedrock Data Automation MCP Server and Amazon Nova Canvas MCP Server. This will allow Agentforce to intelligently process and summarize documents, extract key information from images, transcribe and analyze audio recordings, identify crucial moments in video files, query enterprise knowledge bases, perform semantic code repository searches, and interact with databases through natural language interfaces via Aurora PostgreSQL/MySQL MCP Servers‌ — ‌all enhancing customer service, compliance checks, and operational reporting.\nBox:\nAgentforce can help retrieve the latest signed NDA from a Box MCP service, including a summary of key terms. Agentforce can then post a Slack update to the relevant teams that includes the AI summarization, the contract in PDF form, and recommended next steps.\nGoogle Cloud:\nCustomers can unlock new Agentforce use cases by connecting to key Google and Google Cloud services via MCP. For example, developers will be able to seamlessly connect Agentforce to the Google Maps Platform and generative AI models like Veo, Chirp, Imagen, and Lyria, while also enabling agentic interactions with Google Cloud Databases. This can enable Agentforce actions that span location-based services, creative AI, and transactional data.\nPayPal:\nCustomers can now power a full range of agentic commerce capabilities by connecting Agentforce to PayPal’s MCP server. They can list products, place orders, process payments, dispute claims, track shipping, manage subscriptions, issue refunds, and more with PayPal, making integrations simple and easy.\nStripe:\nAgentforce enables AI agents to directly handle a wide range of Stripe functionalities via its MCP server, including real-time product lookups, quick payment link generation, subscription setup, and faster dispute management.\nWRITER:\nThrough a secure connection to WRITER’s MCP server, Agentforce can call WRITER’s enterprise-grade AI agents to automate content generation, knowledge retrieval, and compliance checks all within Salesforce workflows.\n“AI tools in healthcare must be adaptable to the complex and highly individualized needs of both patients and care teams. We need to support that goal by automating routine interactions in our patient access center that involve common questions and requests, which would free up the team’s time to focus on sensitive, more involved, or complex needs,” said Tyler Bauer, Senior Vice President for System Ambulatory Operations at UChicago Medicine.\nEnhancing the Agentforce Architecture for Unmatched Enterprise Readiness:\nUnderpinning every new capability in Agentforce 3 is an enhanced Atlas architecture, providing an enterprise-ready foundation through lower latency, greater accuracy, global availability, and additional options for control through new\nLLMs\nhosted on Salesforce infrastructure.\nExpanded LLM choice with hosted Anthropic:\nAgentforce can now use Anthropic’s Claude Sonnet model hosted via Amazon Bedrock within the Salesforce trust boundary to meet the needs of customers in high compliance industries. As part of this expanded relationship, Anthropic will work with Salesforce to empower customers in regulated industries to scale Agentforce adoption with Claude. Later this year, Salesforce will also allow customers to use Google’s Gemini in Agentforce, solidifying Agentforce’s position as the leader in trusted, flexible AI agents.\nFaster performance and response streaming:\nExperience a more responsive Agentforce with 50% lower latency since January 2025. Response streaming is also generally available in this release, so users can see answers appear in real time.\nGreater accuracy through web search, inline citations:\nAgentforce 3 features trusted, expanded grounding through the addition of web search as a data source, allowing agents to go beyond internal data to answer requests as well as inline citations that provide references to the grounding sources used in responses.\nMore languages, more geographies:\nAgentforce 3 features an expanded global footprint, deploying to Canada, the U.K., India, Japan, and Brazil to serve AI agent traffic within those regions. This release also adds GA support for six new languages, including French, Italian, German, Spanish, Japanese, and Portuguese — with more than 30 additional languages rolling out in the coming months.\nEnhanced resiliency with automatic model failover:\nTo ensure agents are always on, Agentforce now enables automatic, latency-based failover — dynamically shifting traffic between model providers in case of performance degradation or outages.\nBringing Agentforce to Public Sector customers with FedRAMP High Authorization:\nAgentforce is now authorized and generally available in\nGovernment Cloud Plus\n, which enables public sector customers to bring Agentforce to their missions with the highest standards of trust, security, and compliance.\nUnmatched Industry Readiness Out-of-the-Box Delivers the Fastest Path to Value from AI Agents:\nAgentforce customers in every industry can deliver value from AI agents fast through more than 200 pre-built industry actions — half of them new this summer — from patient scheduling, to advertising proposal generation, to vehicle servicing, and more. Agentforce 3 also introduces simplified,\nflexible pricing\nwith new Agentforce for Sales, Service, and Industry Cloud SKUs with per-user pricing and unlimited usage of actions for employee-facing agents to help teams get started fast and scale boldly.\nDeploy and Scale Agentforce with Confidence Through Trusted Experts:\nThe Salesforce partner ecosystem, including\nAccenture\n,\nDeloitte Digital\n,\nNeuraFlash\n,\nPwC\n, and more, has aided customers across thousands of Agentforce deployments, providing 272,000 certified specialists to deliver strategic guidance and facilitate the successful activation of AI agents that help drive business impact while maintaining governance.\n“With Agentforce, PepsiCo is taking a significant step forward in our agentic journey. By unifying our insights through Salesforce Data Cloud, we’re gaining a holistic view of our customers and operations. This visibility enables us to continue to act strategically, strengthen engagement, and drive greater value across every market we serve,” said Athina Kanioura, Chief Strategy and Transformation Officer at PepsiCo.\nAvailable Today:\nAgentforce 3\nAgentforce adoption analytics\nTesting Center enhancements\n100+ new, pre-built industry actions\nNew Agentforce add-on SKUs with unlimited employee action usage\nHeroku managed MCP server hosting\nIncreased speed and response streaming\nWeb Search for Agentforce Data Libraries\nAgentforce for Government Cloud Plus with FedRAMP High authorization\nExpanded global availability (Canada, U.K., India, Japan, Brazil) and language support (French, Italian, German, Spanish, Japanese, Portuguese)\nIn Pilot or Beta Today:\nAnthropic Claude models hosted within the Salesforce trust boundary — generally available in July\nMuleSoft MCP and A2A support — generally available in July\nHeroku AppLink — generally available in July\nSession Tracing Data Model — generally available in August\nAgent health monitoring — generally available in August\nTo Be Released Soon:\nAgentforce native MCP support – July\nAgentforce Command Center and Agentforce Studio app – August\nLearn more:\nSee the Agentforce 3\nrelease notes\nLearn more about\nAgentforce\nSee the new\nAgentExchange MCP partner collection\nLearn about\nCommand Center\nGo deeper on\nAgentforce MCP support\nSee an in-depth\nproduct demo about MCP\nGet started fast with the new\nAgentforce guide\nExplore\nnew pricing options for Agentforce\nRegister for\nDreamforce 2025\nJoin the Agentblazer Community\nto connect with AI enthusiasts and share insights\nAny unreleased services or features referenced here are not currently available and may not be delivered on time or at all. Customers should make their purchase decisions based upon features that are currently available.\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nSalesforce Quarterly Highlights: FY26 Q2 Product Releases and Corporate Announcements\n8 min read\nIn the Agentic Era, Human Imagination Must Shape the Jobs of Tomorrow\n14 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nEnterprise AI\nFuture of Work\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business for the world of AI. With Agentforce, Salesforce's trusted platform, organizations can bring humans together with agents to drive customer success—powered by AI, data, and action. Visit www.salesforce.com for more information.\nSalesforce Life Sciences Cloud Now Selected by More than 70 Industry-Leading Customers to Scale Engagement and Improve Patient Outcomes\n8 min read\nHow Agentic AI Can Help Overcome the Child Welfare Information Crisis\n8 min read\nManufacturers Gain New AI Workforce: Salesforce’s Agentforce for Manufacturing Optimizes Production, Boosts Sales, and Cuts Downtime\n7 min read\nHow a Texas Boomtown Used AI to Reinvent City Government\n8 min read\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 2906, "token_count": 4019, "ingestion_ts": "2025-09-07T04:08:44.129342", "hash_sha256": "27b62250c0fb8afa3e7566cc41023059ad791313dd4c59adc864771ffeddbe25", "html_title": "", "meta_published_time": "2025-06-23", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false}