{"doc_id": "crm::press::2025-05-15::salesforce-introduces-new-flexible-agentforce-pricing-to-acc::8a83788d", "company": "Salesforce", "doctype": "press", "title": "Salesforce Introduces New Flexible Agentforce Pricing to Accelerate the Digital Labor Revolution", "publish_date": "2025-05-15", "url": "https://www.salesforce.com/news/press-releases/2025/05/15/agentforce-flexible-pricing-news/?bc=DB", "final_url": "https://www.salesforce.com/news/press-releases/2025/05/15/agentforce-flexible-pricing-news/?bc=DB", "source_domain": "salesforce.com", "section": "body", "topic": "Agentforce|Data Cloud|Earnings|Partnership|Product", "persona_tags": ["cio"], "language": "en", "text": "Salesforce Introduces New Flexible Agentforce Pricing - Salesforce\nSkip to Content\nSkip to Footer\n0%\nArtificial Intelligence\nSalesforce Introduces New Flexible Agentforce Pricing to Accelerate the Digital Labor Revolution\nMay 15, 2025\n6 min read\nMedia Library\nNew ‘Flex Credits’ pricing model enables businesses to scale AI-powered digital labor to every employee, department, and process\nSAN FRANCISCO – May 15, 2025 –\nSalesforce (NYSE: CRM), the global leader in AI CRM, today introduced new flexible pricing for Agentforce designed to meet rapidly accelerating demand for digital labor for every employee, department, and business process. AI adoption is moving at an unprecedented pace, yet for many CIOs, the challenge lies in maintaining cost control amid the pressure to innovate.\nSurvey data\nshows 90% of CIOs report that managing AI costs is limiting their ability to drive value.\nOrganizations are increasingly seeking a pricing model aligned to how AI agents deliver business outcomes and create value. This new approach enables teams to start small, experiment flexibly with different use cases, and then scale their success across their entire enterprise, empowering humans and agents to work together seamlessly to drive success.\nTo accelerate this shift toward limitless digital labor capacity, Salesforce today introduced three major pricing innovations explicitly designed to unlock AI adoption at scale, empower organizations to expand their digital workforces, and deliver strategic investment flexibility enterprise-wide:\n1. New Flex Credits to scale Agentforce across every workflow\nThousands of organizations have successfully leveraged Salesforce’s existing conversational pricing at $2 per conversation. Now, Salesforce introduces Flex Credits, offering customers unprecedented flexibility with a consumption-based model that aligns cost with business outcomes. Flex Credits ensure you only pay for the exact actions Agentforce performs‌ — ‌whether that’s updating customer records, automating complex workflows, or resolving cases. Each of these actions consumes just 20 Flex Credits ($0.10 per action), directly tying your investment to measurable, valuable AI-driven results.\nFlex Credits, available in packs of 100,000 credits ($500), empower companies to scale and manage AI investments effectively, driving deeper and broader business outcomes. Through the Salesforce Digital Wallet, customers can strategically allocate AI spend to align directly with high-value use cases, optimizing their AI initiatives for maximum impact. Additionally, organizations gain detailed insights into usage trends, credit consumption, demand forecasting, and can proactively manage their supply of credits as new agents launch and AI adoption expands.\n2. New Flex Agreement to shift investment as priorities change\nSalesforce’s new Flex Agreement allows organizations to manage both human and digital labor and strategically shift their investments between user licenses or digital labor as their business priorities demand. This agreement enables customers to get the most from their budgets, converting user licenses into Flex Credits, or Flex Credits into new user licenses, for exploring new, value-generating use cases. The structure of the Flex Agreement empowers organizations to continually adapt their AI investment strategies, supporting expanded growth and revenue opportunities while increasing overall spending efficiency.\n3. New Agentforce user licenses, and add-ons with included Agentforce usage\nOrganizations today are actively leveraging Agentforce to empower their teams, driving growth and innovation across every department. Customers are successfully deploying specialized\nAI agents\nto work side-by-side with their employees‌ — ‌automating routine tasks in sales, streamlining employee onboarding in HR, rapidly surfacing IT knowledge, and proactively resolving customer service cases.\nSalesforce’s new Agentforce user licenses and add-ons make it easier than ever to bring these powerful capabilities to every employee, offering unmetered employee-facing agent usage in a simple per user per month (PUPM) pricing model. With AI seamlessly integrated within Salesforce and Slack, businesses can effortlessly and confidently augment their teams in every part of their business with digital labor‌ — ‌all without the concern of running into usage caps.\nWhat Industry Analysts & Customers Are Saying\n“Salesforce’s new flexible pricing model allows us to use AI agents for different types of use cases far beyond customer service and traditional CRM, and aligns our costs directly with the business value we achieve,” said Elia Wallen, CEO, Engine. “It’s a sign of Salesforce’s ongoing evolution from a software provider into a technology partner that’s deeply embedded with our IT organization so that we can deploy AI agents across our company and scale business results using their tools and technology.”\nSalesforce’s new flexible pricing model allows us to use AI agents for different types of use cases far beyond customer service and traditional CRM, and aligns our costs directly with the business value we achieve.\nElia Wallen, CEO, Engine\n“AI implementation is a business decision as much as a technology one,” said Kirsten Rhodes, Vice Chair, Client Relationship Development Leader, Deloitte US. “Salesforce’s new approach gives organizations the ability to customize their investments to not only help achieve their goals now but the flexibility to adapt to their evolving needs in the future.”*\n“The shift toward a flexible consumption model is exactly what’s needed to empower organizations to adopt AI more confidently as Agentforce’s capabilities expand to new use cases far beyond conversation-based customer interactions,” said Ritu Jyoti, GVP and GM, AI and Data at IDC. “It allows businesses to align their investments more closely with the value derived from agent performance, and Salesforce has taken it a step further – giving customers flexibility not just in how they use credits but allowing them to swap between seats and credits as companies experiment with deploying ‘digital labor’ in their organizations.”\n“This new approach should make it much easier to do business with Salesforce – particularly as their portfolio of offerings expands with the evolution of agentic AI and their platform approach with Agentforce,” said Patrick Moorhead, CEO and Chief Analyst, Moor Insights & Strategy. “Allowing customers the flexibility to reallocate budget or swap unused licenses for credits that can be used toward new investments like Agentforce, is very powerful and unique. It’s lowering the barrier to entry for experimentation and adoption of Agentforce.”\n“Our research indicates that businesses are continuing to significantly invest in agentic AI to improve customer experiences as expectations around personalization and fast resolution times increase,” said Sheryl Kingstone, Distinguished Analyst, 451 Research, part of S&P Global Market Intelligence. “While the majority of businesses still prefer to purchase technology using a license model, there is a rising desire for pricing that’s aligned to outcomes.”**\nPricing Summary\nFlex Credits — Pay per action as you scale with Agentforce\n$500 USD per 100,000 Credits\nOne Agentforce action consumes 20 Flex Credits ($0.10 USD)\nAll customers with Enterprise Edition or above can get 100,000 Flex Credits for $0 with Salesforce Foundations.\nAgentforce user licenses and add-ons — coming Summer 2025\nAgentforce for Sales, Service, and Industries — pricing to be announced at GA\nAgentforce 1 Editions for Sales, Service, Field Service, and Industries — pricing to be announced at GA\nAvailability\nFlex Credits are available to purchase today for all Agentforce customers.\nFlex Agreement is available today. Ask your Account Executive for more information.\nNew Agentforce for employees functionality is available today with the purchase of Flex Credits.\nAgentforce 1 Editions and Agentforce add-ons coming Summer 2025.\nFlex Payment Models coming Fall 2025.\nThis article may include references to services or features that are still in development and are unreleased. Customers should make their purchase decision based on fully released and available features\n.\n*Please see www.deloitte.com/us/about for a detailed description of their legal structure.\n**Source: 451 Research, part of S&P Global Market Intelligence — Amid rapid change, customer experience investments continue to support digital engagement — Highlights from VotE: Customer Experience & Commerce\nLearn More\nCheck out Salesforce’s\nCIO AI Trends research\nto learn why 67% of CIOs are taking a more measured approach to AI adoption\nRead why 90% of CIOs say managing AI costs is limiting their ability to drive value, according to\nCIO.com\nCheck out how customers like\nAdecco Group\n,\nOpenTable\n, and\nPrecina\nare scaling smarter and driving faster outcomes with Agentforce\nExplore the\nAgentforce ROI Calculator and Estimator\nto understand the business impact of scaling AI agents across sales, sales enablement, and service\nDiscover how Salesforce\nData Cloud\nconnects real-time customer data to help organizations drive smarter, AI-powered engagement across every touchpoint\nSee how\nDigital Wallet\nprovides real-time tracking of Flex Credit usage to help teams optimize investments over time\nLearn more about\nSalesforce Foundations\n, which gives you the ability to have a free tier of every Salesforce cloud you don’t already have access to, including Agentforce\nEditor’s Note: Research citation was updated in August 2025.\nShare article\nJust For You\nThe Zero Copy Imperative: IBM, Salesforce, and Snowflake Experts on Data’s Role Enabling Agentic AI\n3 min read\nWhy Daily AI Use Is Fueling More Creative and Fulfilled Workers\n4 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nShare article\nJust For You\nThe Zero Copy Imperative: IBM, Salesforce, and Snowflake Experts on Data’s Role Enabling Agentic AI\n3 min read\nWhy Daily AI Use Is Fueling More Creative and Fulfilled Workers\n4 min read\nBuild and customize autonomous AI agents to support your employees and customers 24/7.\nDiscover Agentforce\nExplore related content by topic\nAgents\nArtificial Intelligence\nDigital Transformation\nAbout Salesforce\nSalesforce helps organizations of any size reimagine their business with AI. Agentforce — the first digital labor solution for enterprises — seamlessly integrates with Customer 360 applications, Data Cloud, and Einstein AI to create a limitless workforce, bringing humans and agents together to deliver customer success on a single, trusted platform.\nVisit\nwww.salesforce.com\nfor more information.\nRelated Articles\nHow Salesforce’s Open Ecosystem Is Driving Trusted Agent Interoperability\n7 min read\nNew MuleSoft Innovations from Salesforce Enable Secure, Scalable AI Agent Orchestration for Agentic Transformation\n7 min read\nSalesforce Collaborates with UChicago Medicine to Enhance Patient Support\n3 min read\nSalesforce Launches Agentforce for Net Zero Cloud with Unified Data to Help Teams Meet Sustainability Compliance, Cut Costs, and Drive Efficiency\n14 min read\nGet the latest Salesforce News\nSubscribe\nClose\nWorldwide\nAmericas\nAmérica Latina (Español)\nBrasil (Português)\nCanada (English)\nCanada (Français)\nUnited States (English)\nEurope, Middle East, and Africa\nEspaña (Español)\nDeutschland (Deutsch)\nFrance (Français)\nItalia (Italiano)\nNederland (Nederlands)\nSverige (Svenska)\nUnited Kingdom (English)\nAll other countries (English)\nAsia Pacific\nAustralia (English)\nIndia (English)\n日本 (日本語)\n中国 (简体中文)\n香港 (繁體中文)\n台灣 (繁體中文)\n한국 (한국어)\nMalaysia (English)\nประเทศไทย (ไทย)\nAll other countries (English)\n© Copyright 2024 Salesforce, inc.\nAll rights reserved.\nVarious trademarks held by their respective owners. Salesforce, inc. Salesforce Tower, 415 Mission Street, 3rd Floor, San Francisco, CA 94105, United States\nSkip to Content\nSkip to Header\nCopied", "word_count": 1754, "token_count": 2402, "ingestion_ts": "2025-09-06T21:57:15.130062", "hash_sha256": "5efee92ea176e65988965158102de974f4a97e6ad6221d61158247b3040b207b", "html_title": "", "meta_published_time": "2025-05-15", "last_modified_http": "", "full_domain": "www.salesforce.com", "publish_date_provenance": "rss_pubdate", "publish_date_confidence": 0.95, "was_fallback_today": false, "link_ok": true, "link_status": 200}